Repository: OpenTechSchool/python-beginners
Catalog: source/_locales/*/LC_MESSAGES/pybeginners.po
Languages: de

source: when trying to view help? In Python you have to import names before you can refer to them, so in a new Python interactive shell you'll need to ``import turtle`` before ``help(turtle.color)`` will work.
de: In Python musst Du Namen von Modulen oder Funktionen importieren bevor Du sie verwenden kannst. Also musst Du in einem neuen Python-Shell Fenster zuerst ''import turtle'' schreiben, bevor ''help(turtle.color)'' funktioniert.

source: Another way to find out about functions is to browse the `online documentation`__.
de: Ein anderer Weg etwas über Funktione zu erfahren ist die 'Online Dokumentation' zu lesen.

source: If you misdrew anything, you can tell turtle to erase its drawing board with the ``turtle.reset()`` directive or undo the most recent step with ``turtle.undo()``.
de: Falls Du etwas falsch gezeichnet hast, kannst Du turtle befehlen, die Zeichenfläche mit dem ''turtle.reset()'' Befehl vollständig zu löschen oder den letzten Befehl mit ''turtle.undo'' Rückgängig zu machen.

source: As you might have read in the help, you can modify the color with :samp:`turtle.color({colorstring})`. These include but are not limited to "red," "green," and "violet." See the `colors manual`__ for an extensive list.
de: Wie du vielleicht in der Hilfe gelesen hast kannst du die Farben mit :samp:`turtle.color({Farbe})` verändern. Farben können zum Beispiel "red", "green" oder "violet" sein. Lies im `colors manual`_`__ nach für eine komplette Liste.

source: Drawing a rectangle
de: Ein Rechteck zeichnen

source: Can you draw a rectangle too?
de: Kannst du auch ein Rechteck zeichenn?

source: How about a triangle? In an equilateral triangle (a triangle with all sides of equal length) each corner has an angle of 60 degrees.
de: Wie wäre es mit einem Dreieck? In einem gleichseitigen Dreieck (alle Seiten haben die gleiche Länge) hat jede Ecke einen Winkel von 60 Grad.

source: More squares
de: Mehr Quadrate

source: Now, draw a tilted square. And another one, and another one. You can experiment with the angles between the individual squares.
de: Jetzt zeichne ein schräg zur Seite gekipptes Quadrat. Und noch eins, und noch eins. Experimentiere mit den Winkeln zwischen den einzelnen Quadraten.

source: The picture shows three 20 degree turns. You could try 20, 30 and 40, for example.
de: Das Bild zeigt drei Drehungen um jeweils 20 Grad. Du kannst zum Beispiel auch 20, 30 oder 40 Grad ausprobieren.

source: Variables
de: Variablen

source: Whew. Experimenting with the angles requires you to change three different places in the code each time. Imagine you'd want to experiment with all of the square sizes, let alone with rectangles! We can do better than that.
de: Puh. Wenn Du mit den Winkeln experimentiers, musst Du jedes Mal an drei verschiedenen Stellen den Code verändern. Jetzt stelle Dir vor Du möchtest mit allen Abmessungen des Quadrates experimentieren, oder sogar mit Rechtecken! Das muss besser gehen.

source: This is where **variables** come into play: You can tell Python that from now on, whenever you refer to a variable, you actually mean something else. That concept might be familiar from symbolic maths, where you would write: *Let x be 5.* Then *x \* 2* will obviously be *10*.
de: An dieser Stelle kommen **Variablen** ins Spiel: Du kannst ab nun Python befehlen, jedes Mal wenn Du eine bestimmte Variable verwendest, an dieser Stelle etwas anderes einzusetzen. Dieses Konzept ist ähnlich zur Algebra, wo Du schreiben könntest: *x sei 5*. Dann ist *x \* 2* natürlich *10*.

source: In Python syntax, that very statement translates to::
de: In der Syntax von Python hat die gleiche Bedeutung::

source: After that statement, if you do ``print(x)``, it will actually output its value --- 5. Well, can use that for your turtle too::
de: Falls Du nach diesem Befehl ''print(x)'' ausführst, wird der Wert von x ausgegeben --- 5. Du kannst das gleiche auch mit turtle kombinieren.

source: Variables can store all sorts of things, not just numbers. A typical other thing you want to have stored often is a **string** - a line of text. Strings are indicated with a starting and a leading ``"`` (double quote). You'll learn about this and other types, as those are called in Python, and what you can do with them later on.
de: Variablen können alles mögliche speichern, nicht nur Zahlen. Etwas anderes typisches das oft in Variablen gespeichert wird sind **Strings** - Textzeilen. Strings werden durch ''"'' (doppelte Anführungszeichen) vor und nach dem Text gekennzeichnet. Du wirst später noch mehr über diese sogenannten Datentypen in Python und was Du mit ihnen tun kannst, lernen.

source: You can even use a variable to give the turtle a name::
de: Du kannst sogar eine Variable verwenden um der Schildkröte einen Namen zu geben::

source: Now every time you type ``timmy`` it knows you mean ``turtle``. You can still continue to use ``turtle`` as well::
de: Jedes Mal wenn Du nun ''timmy'' schreibst, weiss Python, dass Du ''turtle'' meinst. Du kannst auch weiterhin ''turtle'' verwenden::

source: A variable called angle
de: Eine Variable genannt angle

source: If we have a variable called ``angle``, how could we use that to experiment much faster with our tilted squares program?
de: Wenn wir eine Variable ''angle'' (Winkel) nennen, wie könnten wir sie verwenden um mit dem Programm mit den gekippten Quadraten zu experimentieren?

source: ... and so on
de: ... und so weiter

source: Can you apply that principle to the size of the squares, too?
de: Kannst Du das gleiche Prinzip auch auf die Grösse der Quadrate anwenden?

source: The house of santa claus
de: Das Haus vom Nikolaus

source: Draw a house.
de: Zeichne ein Haus.

source: You can calculate the length of the diagonal line with the Pythagorean theorem. That value is a good candidate to store in a variable. To calculate the square root of a number in Python, you'll need to import the *math* module and use the ``math.sqrt()`` function. The square of a number is calculated with the ``**`` operator::
de: Du kannst die Länge der diagonalen Linie mit dem Satz des Pythagoras ausrechnen. Diese Zahl ist es wert in einer Variable gespeichert zu werden. Um die Quadratwurzel einer Zahl in Python zu berechnen, musst Du das *math* Modul importieren und die Funktion ''math.sqrt()'' aufrufen. Das Quadrat einer Zahl kannst Du mit dem Operator ''**'' ausrechnen::
