Repository: OpenTechSchool/python-beginners
Catalog: source/_locales/*/LC_MESSAGES/pybeginners.po
Languages: de

source: Different linux distributions (e.g Ubuntu, Fedora, Mint) may have different console programs, usually referred to as a terminal. The exact terminal you start up, and how, can depend on your distribution. On Ubuntu, you will likely want to open Gnome Terminal. It should present a prompt like this::
de: Unterschiedliche Linux-Distributionen (z.B. Ubuntu, Fedora, Mint) haben verschiedene Konsolenprogramme, auch genannt Terminals. Welches Terminal Du genau verwendest, hängt von Deiner Distribution ab. Unter Ubuntu ist das typischerweise Gnome Terminal. Es stellt einen Prompt wie folgt dar::

source: Opening a console on Windows
de: Eine Konsole unter Windows öffnen

source: Window's console is called the Command Prompt, named "cmd.exe". An easy way to get to it is by using the key combination "Windows+R" ('Windows' meaning the windows logo button), which should open a 'Run' dialog. Then simply type :kbd:`cmd` and hit :kbd:`<Enter>` / click Ok. It should look like::
de: Die Konsole von Windows wird auch Kommandoprompt, oder "cmd.exe" genannt. Ein einfacher Weg sie zu öffnen ist die Tastenkombination "Windows+R" (mit Windows ist die Taste mit dem Windows Logo gemeint). Dies sollte einen Dialog 'Ausführen' öffnen. Dort tippst Du einfach :kbd:'cmd' ein und drückst :kdb:'Enter' oder klickst Ok. Das Ergebnis sollte so aussehen::

source: Window's Command Prompt is not quite as powerful as its counterparts on Linux and OS X, so you might like to start the Python Interpreter (see just below) directly, or using the IDLE program that Python comes with. You can find these in the start menu.
de: Die Konsole unter Windows ist nicht ganz so mächtig wie ihre Gegenstücke unter Linux und OS X, daher ist es empfehlenswert direkt den Python Interpreter zu starten (siehe unten), oder den Editor IDLE, der zusammen mit Python installiert wird. Du findest beide im Startmenü.

source: Using Python
de: Python verwenden

source: The python program that you have installed by default will act as something called an **interpreter**. An interpreter will take commands and run them as you enter them, very handy for trying things out.
de: Das Programm Python welches Du installiert hast, fungiert als ein sogenannter **Interpreter**. Ein Interpreter nimmt Anweisungen entgegen und führt sie aus sobald Du sie eingibst. Das ist sehr nützlich um Dinge auszuprobieren.

source: Just type :program:`python` at your console, hit :kbd:`<Enter>`, and you should enter Python's Interpreter.
de: Tippe in Deiner Konsole ein :program:'python', drücke :kdb:'<Enter>', und Der Python Interpreter sollte starten.

source: To find out which version of python you're running, use :program:`python -V` to tell you.
de: Um herauszufinden welche Version von Python Du verwendest, gib ein :program:'python -V'.

source: Interacting With Python
de: Mit Python interagieren

source: After Python opens, it will show you some contextual information similar to this::
de: Sobald Python startet, zeigt es Dir einige Kontextinformationen ähnlich zu diesen::

source: The prompt **>>>** on the last line indicates that you are now in an interactive Python interpeter session, also called the "Python shell". **This is different from the normal terminal command prompt!**
de: Der Prompt **>>>** in der letzten Zeile signalisiert dass Du Dich nun in der interaktiven Python Konsole befindet, auch ''Python Shell'' genannt. **Diese Konsole ist etwas anderes als das normale Kommandozeilenterminal!**

source: You can now enter some python code. Try::
de: Nun kannst Du Python Code eingeben. Versuche::

source: Press :kbd:`<Enter>` and see what happens. After showing the results, Python will bring you back to the interactive prompt, where you could enter another command::
de: Drücke :kbd:'<Enter>' und sieh was passiert. Nachdem Python Dir die Ergebnisse angezeigt hat, gelangst Du zurück zum interaktiven Prompt wo Du einen weiteren Befehl eingeben kannst::

source: An extremely useful command is ``help()``, which enters a help functionality to explore all the stuff python lets you do, right from the interpreter.
de: Ein ausserordentlich nützlicher Befehl ist ''help()'', welcher die interne Hilfsfunktion von Python aufruft. Du kannst dort alles was Python kann innerhalb des Interpreters erkunden.

source: To leave the interactive shell, press :kbd:`Ctrl-Z` and then :kbd:`Enter` on Windows, or :kbd:`Ctrl-D` on OS X or Linux. Alternatively, you could also run the python command ``exit()``!
de: Um die Python Shell zuverlassen, drücke :kbd:'Ctrl-Z' und :kbd:'Enter' unter Windows, oder :kbd:'Ctrl-D' unter OS X oder Linux. Alternativ kannst Du auch den Python-Befehl ''exit()'' ausführen.

source: Running Python files
de: Pythonprogramme ausführen

source: When you have a lot of python code to run, you will want to save it into a file, so you for instance can modify small parts of it (fix a bug) and re-run it, without having to repeatedly re-type the rest. Instead you can save your code to a file and pass a file name to the :program:`python` executable. It will execute that file instead of launching the interactive interpreter.
de: Wenn Du eine grosse Menge Python-Code ausführen möchtest, empfiehlt es sich, diesen in einer Datei zu speichern, so dass Du leicht einzelne Zeilen verändern (z.B. Fehler korrigieren) und dann von Neuem ausführen kannst. Anstatt immer wieder die gleichen Zeilen einzutippen, kannst Du Deinen Code in einer Datei abspeichern und den Dateinamen an das Programm :program:'python' übergeben. Dies führt Dein Programm aus anstatt den interaktiven Interpreter zu starten.

source: Make sure you are at your system command prompt, which will have ``$`` or ``>`` at the end, not at python's (which has ``>>>`` instead)!
de: Versichere dich, dass du dich in der Kommandozeile befindest, die du an ``$`` oder ``>`` am Ende erkennst, nicht in Pythons (welche ``>>>`` hat).

source: Let's try that. Create a file :file:`hello.py` in your current directory with your favorite text editor and paste the print command from above. Now save that file. On Linux or OS X, you can also run :kbd:`touch hello.py` to create an empty file to edit. To run this file with python, it's pretty easy:
de: Probieren wir das einmal aus. Erstelle eine Datei :file:'hello.py' in Deinem aktuellen Verzeichnis mit einem Texteditor Deiner Wahl und füge den print-Befehl von oben dort ein. Jetzt speichere die Datei ab. Unter Linux und OS X kannst Du auch eine leere Datei mit dem Befehl :kbd:'touch hello.py' erstellen. Das Ausführen dieses Programms ist denkbar einfach:

source: Not getting "Hello world" but some crazy error about "can't open file" or "No such file or directory?" Your command line might not be running in the directory you saved the file in. You can use the system command line to change your active directory with the :command:`cd` command, which stands for "change directory". On Windows, you might want something like::
de: Du siehst kein "Hello world" sondern irgendeinen komischen Fehler wie "can't open file" oder "No such file or directory"? Vielleicht befindet sich deine Kommandozeile nicht in dem Ordner, in dem du die Datei gespeichert hast. In der Kommandozeile kannst du den Befehl :command:`cd` ("change directory") benutzen um deinen ausgewählten Ordner zu wechseln. Unter Windows kannst du folgendes ausprobieren::

source: On Linux or OS X, you might want something like::
de: Unter Linux oder OX X hilft Dir möglicherweise dies::

source: This changes to the directory Python_Exercises under the Desktop folder (yours might be somewhere a bit different). If you don't know the location of the directory where you saved the file, you can simply drag the directory to the command line window. If you don't know which directory your shell is currently running in use :command:`pwd`, which stands for "print working directory".
de: Dieser Befehl wechselt in das Verzeichnis Python_Exercises innerhalb des Desktop-Ordners (auf Deinem Computer heisst dieser eventuell anders). Falls Du nicht weisst in welchem Verzeichnis Du die Textdatei mit dem Programm abgespeichert hast, kannst Du einfach das Ordnersymbol in das Terminalfenster ziehen. Falls Du nicht weisst in welchem Verzeichnis sich Deine Textkonsole grade befindet, verwende den Befehl :command:'pwd', der für "print working directory" steht.

source: On Windows you should also be able to double-click the Python file to run it.
de: Unter Windows solltest Du auch die Python-Datei doppelklicken können um sie auszuführen. (Stimmt, aber falls dort nur ein print steht geht das Fenster gleich wieder zu. A.d.Ue)

source: When pressing :kbd:`<Enter>` now, the file is executed and you see the output as before. But this time, after Python finished executing all commands from that file it exits back to the system command prompt, instead of going back to the interactive shell.
de: Wenn Du nun :kbd:'<Enter>' drückst, wird das Programm in der Datei ausgeführt, und Du siehst die gleiche Ausgabe wie zuvor. Aber diesmal kehrt Python nach Ausführen der Befehle in der Datei zurück zur Kommandozeile Deines Betriebssystems anstatt in den Interpreter.

source: Wordpad, TextEdit, Notepad, and Word are **not** suitable text editors. If you are unsure whether you already have a usable editor, you might want to download and install `Sublime Text <http://www.sublimetext.com/>`_. Code editors like this can also help you with formatting, running and debugging your code.
de: Wordpad, TextEdit, Notepad und Word sind **keine** geeigneten Texteditoren um Python-Programme zu schreiben. Falls Du Dir nicht sicher bist, ob Du bereits einen geeigneten Editor hast, kannst Du 'Sublime Text <http://www.sublimetext.com/>' herunterladen und installieren. Code-Editoren wie dieser helfen Dir, Code zu formatieren, auszuführen und zu Fehler aufzuspüren (debugging).

source: And now we are all set and can get started with turtle!
de: Wir sind jetzt startklar und können mit der Schildkröte anfangen!

source: When playing around with turtle, avoid naming your file :file:`turtle.py` --- rather use more appropriate names such as :file:`square.py` or :file:`rectangle.py`. Otherwise, whenever you refer to ``turtle``, Python will pick up *your* file instead of the standard turtle.
de: Wenn Du mit dem Modul turtle experimentierst, vermeide es Deine Datei :file:'turtle.py' zu nennen --- verwende lieber Namen wie :file:'quadrat.py' oder :file:'rechteck.py'. Andernfalls wird Python jedesmal wenn Du den Namen ''turtle'' verwendest, *Deine* Datei anstatt dem Modul turtle verwenden.

source: Introduction to Programming with Python
de: Programmiereinführung mit Python

source: Table of contents:
de: Inhaltsverzeichnis:

source: Logical operators
de: Logische Operatoren

source: Conditionals are a nice way to make decisions by asking if something equals *True* or not. But often one condition is not enough. We may want to take the opposite of our result. Or for instance if we want to make a decision upon ``turtle.xcor()`` and ``turtle.ycor()`` we have to combine them. This can be done with logical operators.
de: Verzweigungen sind ein guter Weg um im Programm Entscheidungen zu treffen, indem geprüft wird ob etwas *True* ist oder nicht. Aber häufig reicht eine Bedingung allein nicht aus. Vielleicht möchtest Du auch das Gegenteil Deines Ergebnisses prüfen. Oder falls Du eine Entscheidung aufgrund von ''turtle.xcor()'' und ''turtle.ycor()'' treffen möchtest, musst Du beide verknüpfen. Das kannst Du mit logischen Operatoren erreichen.

source: Negation of a statement
de: Verneinung eines Ausdrucks

source: If we want something to be *False* we can use ``not``. It is a logical operator::
de: Wenn wir möchten, dass etwas *False* ist, können wir den logischen Operator ''not'' verwenden::

source: The turtle gives us a useful function to know if it is drawing or not: ``turtle.isdown()``. This function returns *True* if the turtle is drawing. As we have seen earlier, the function ``turtle.penup()`` and ``turtle.pendown()`` toggle between drawing while moving, or just moving without a trace.
de: Die Schildkröte enthält eine nützliche Funktion die sagt ob grade gezeichnet wird oder nicht; ''turtle.isdown()''. Diese Funktion liefert *True* falls die Schildkröte im Zeichenmodus ist. Wie wir bereits gesehen haben, schalten die Funktionen ''turtle.penup()'' und ''turtle.pendown()'' zwischen dem Modus zum Zeichnen beim Bewegen und dem Bewegungsmodus ohne Zeichnen hin und her.

source: Can we write a function that only goes forward if the pen is up?
de: Können wir eine Funktion schreiben die nur vorwärts geht falls die Schildkröte nicht im Zeichenmodus ist?

source: This and that or something else
de: Dies und jenes oder etwas anderes

source: Two easy to understand operators are ``and`` and ``or``. They do exactly what they sound like:::
de: Zwei einfach zu verstehende Operatoren sind ''and'' und ''or''. Sie tun genau das wonach sie sich anhören:::

source: You are not restricted to one logical operator. You can combine as may as you want.
de: Du bist nicht darauf angewiesen nur einen logischen Operator zu verwenden. Du kannst so viele miteinander kombinieren wie Du möchtest.

source: Earlier we put the turtle in a circular prison. This time let's make it a box. If the turtle goes more than 100 in the X *or* Y axis then we turn the turtle back around to the center.
de: Weiter oben haben wir die Schildkröte in einem kreisförmigen Gefängnis eingesperrt. Diesmal werden wir ein Quadrat dazu verwenden. Falls die Schildkröte sich mehr als 100 Einheiten entlang der x- *oder* y-Achse vom Mittelpunkt entfernt, drehen wir sie zurück zur Mitte um.

source: Loops
de: Schleifen

source: One more thing: Our programs often feature repetition. There is a powerful concept in Python called looping (jargon: *iteration*), which we will elaborate later on. For now, try this easy example::
de: Noch etwas: Unsere Programme enthalten oft Wiederholungen. In Python gibt es ein mächtiges Konzept genannt Schleifen (Jargon: Iterationen), welches wir später genauer erkunden werden. Erst einmal probieren wir dieses einfache Beispiel aus::

source: This is incredibly helpful if we want to do something multiple times --- say, drawing the individual border lines of a shape --- but only want to write it once. But it gets better::
de: Dies ist ausserordentlich hilfreich wenn wir etwas mehrere Male tun möchten --- beispielsweise die Umrandung einer geometrischen Form zeichnen --- aber den Programmcode dafür nur einmal schreiben möchten. Aber es wird noch besser::

source: Notice how we write only one line of code using ``i`` but it has 10 different values?
de: Beachte dass wir nur eine einzige Zeile Code mit ''i'' schreiben, aber sie 10 unterschiedliche Werte annimmt.

source: You can also loop over elements of your choice::
de: Du kannst auch Elemente Deiner Wahl in einer Schleife verarbeiten::

source: The ``range(n)`` function can be considered a shorthand for ``0, 1, 2, ..., n-1``. If you want to know more about it, you can use the help in the Python shell by typing ``help(range)``. Use the :kbd:`q` key to exit the help again.
de: Die Funktion ''range(n)'' kann als Abkürzung für ''0, 1, 2, ..., n-1'' betrachtet werden. Falls Du mehr über sie wissen möchtest, kannst Du die Hilfefunktion im Python-Interpreter verwenden, indem Du ''help(range)'' eingibst. Verwende die Taste :kbd:'q' um die Hilfe wieder zu schliessen.

source: If you want to repeat some code a number of times, but don't care about the value of the ``i`` variable, it can be good practice to replace it with ``_`` instead. This signifies that we don't care about its value, or don't wish to use it. So you could rewrite the first example as::
de: Falls du Code eine bestimmte Anzahl von Malen wiederholt ausführen möchtest, aber der Wert der Variable ''i'' Dich nicht interessiert, kann es sinnvoll sein ''i'' durch ''_'' zu ersetzen. Das zeigt an dass uns der Wert der Variablen nicht interessiert oder wir nicht vorhaben ihn zu benutzen. Du könntest das erste Beispiel dementsprechend auch so schreiben::

source: Drawing a dashed line
de: Eine gestrichelte Linie zeichnen

source: Draw a dashed line. You can move the turtle without the turtle drawing its movement by using the ``turtle.penup()`` function; to tell it to draw again, use ``turtle.pendown()``.
de: Zeichne eine gestrichelte Linie. Du kannst die Schildkröte bewegen ohne dass sie zeichnet, indem Du die Funktion ''turtle.penup()'' aufrufst; um sie wieder zeichnen zu lassen, verwende ''turtle.pendown()''.

source: Can you make the dashes become larger as the line progresses?
de: Kannst du die Striche immer größer werden lassen?

source: Feeling lost? Inspect ``i`` at every run of the loop::
de: Verwirrt? Schau dir ``i`` in jedem Schleifendurchlauf an::

source: Can you utilize ``i`` --- commonly called the **index** variable or loop variable --- to get increasing step sizes?
de: Kannst du ``i`` --- üblicherweise als **Index**\ - oder Schleifenvariable bezeichnet --- benutzen um immer größere Schritte zu machen?

source: Honeycomb loops
de: Honigwaben in Schleifen

source: Take your honeycomb program and make it easier with loops. How small can you get it?
de: Nimm dein Honigwaben-Programm und vereinfache es mithilfe von Schleifen. Wie klein kriegst du es?

source: See if you can look at your earlier square-drawing code, and make it much shorter by using loops.
de: Schau dir nochmal deinen Code zum Malen von Vierecken von vorhin an; kannst du ihn mit Schleifen kompakter machen?

source: Simple drawing with turtle
de: Einfaches Zeichnen mit turtle

source: Turtle is like a drawing board.
de: Turtle ist wie ein Zeichenbrett.

source: It has functions like ``turtle.forward(...)`` and ``turtle.left(...)`` which can move the turtle around.
de: Das Modul besitzt Funktionen wie ''turtle.forward(...)'' und ''turtle.left(...)'' welche die Schildkröte umher bewegen.

source: Before you can use turtle, you have to import it (we'd recommend playing around with it in the interactive interpreter first, there is an extra bit of work required to make it work from files)::
de: Bevor Du das Modul turtle verwenden kannst, musst Du es importieren (wir empfehlen erst einmal damit im interaktiven Interpreter damit herumzuprobieren, damit es in einer Programmdatei funktioniert ist ein wenig zusätzlicher Aufwand erforderlich)::

source: Not seeing anything on Mac OS? Try looking if a new window opened behind your command line.
de: Du verwendest Mac OS und siehst nichts? Schaue nach ob hinter Deinem Textfenster ein weiteres neues Fenster aufgesprungen ist.

source: The ``turtle.forward(...)`` function tells the turtle to move forward by the given distance. ``turtle.left(...)`` takes a number of degrees which you want to rotate to the left. (There are ``turtle.backward(...)`` and ``turtle.right(...)``, too.)
de: Die Funktion ''turtle.forward(...)'' lässt die Schildkröte um die angegebene Strecke nach vorne gehen. ''turtle.left(...)'' dreht sie um die angegebene Anzahl Grad nach links. (Es gibt ebenfalls die Funktionen ''turtle.backward(...)'' und ''turtle.right(...)''.)

source: The standard turtle is just a triangle. That's no fun! Let's make it a turtle instead with the ``turtle.shape()`` command::
de: Standardmässig wird die Schildkröte auf dem Bildschirm als Dreieck dargestellt. Wie langweilig! Lass uns mit der Funktion ''turtle.shape()'' eine richtige Schildkröte daraus machen::

source: So much cuter!
de: Das ist doch viel niedlicher!

source: If you put the commands into a file, you might have recognized that the turtle window vanishes after the turtle finished its movement. (That is because Python exits when your turtle has finished moving. Since the turtle window belongs to Python, it terminates as well.) To prevent that, just put ``turtle.exitonclick()`` at the bottom of your file. Now the window stays open until you click on it::
de: Wenn Du die Befehle in eine Datei geschrieben hast, hast Du vielleicht bemerkt, dass das turtle-Fenster verschwindet, nachdem die Schildkröte ihre Bewegung vollendet hatte. (Das geschieht weil Python beendet wird, sobald der letzte Befehl ausgeführt wurde. Und da das turtle-Fenster mit zu Python gehört, wird es auch geschlossen.) Um das zu verhindern, füge am Ende Deines Programms ''turle.exitonclick()'' hinzu. Jetzt bleibt das Fenster offen bis Du noch einmal darauf klickst::

source: Python is a programming language where horizontal indenting of text is important. We'll learn all about this in the Functions chapter later on, but for now just keep in mind that stray spaces or tabs before any line of Python code will cause an unexpected error.
de: Python ist eine Programmiersprache, bei der das horizontale Einrücken von Befehlen wichtig ist. Wir werden im Kapitel über Funktionen mehr darüber erfahren. Für den Anfang reicht es zu wissen dass zusätzliche Leerzeichen oder Tabulatoren am Anfang einer Zeile mit Python-Code zu Programmfehlern führen.

source: Drawing a square
de: Ein Rechteck zeichnen

source: You're not always expected to know the anwer immediately. Learn by trial and error! Experiment, see what python does when you tell it different things, what gives beautiful (although sometimes unexpected) results and what gives errors. If you want to keep playing with something you learned that creates interesting results, that's OK too. Don't hesitate to try and fail and learn from it!
de: Niemand erwartet von Dir, dass Du sofort auf die Antwort kommst. Lerne durch Ausprobieren! Experimentiere damit was Python tut wenn Du verschiedene Befehle erteilst, was zu schönen (wenn auch manchmal unerwarteten) Ergebnissen führt, und was Fehler verursacht. Wenn Du etwas findest dass für Dich interessante Ergebnisse erzeugt und Du weiter damit herumprobieren möchtest, ist das auch in Ordnung. Zögere nicht etwas zu versuchen, und daraus zu lernen falls es schief geht!

source: Draw a square as in the following picture:
de: Zeichne ein Quadrat so wie im folgenden Bild:

source: For a square you will probably need a right angle, which is 90 degrees.
de: Für ein Viereck brauchst du vermutlich einen rechten Winkel, welcher 90˚ beträgt.

source: Notice how the turtle starts and finishes in the same place and facing the same direction, before and after drawing the square. This is a useful convention to follow, it makes it easier to draw multiple shapes later on.
de: Beachte wie die Schildkröte an der gleichen Stelle in der gleichen Richtung startet und nach Zeichnen des Quadrats stoppt. Dies ist als Konvention nützlich, denn es erleichtert das Zeichnen von mehreren geometrischen Formen hintereinander.

source: If you want to get creative, you can modify your shape with the ``turtle.width(...)`` and ``turtle.color(...)`` functions. How do you use these functions? Before you can use a function you need to know its *signature* (for example the number of parameters and what they mean.) To find this out you can type ``help(turtle.color)`` into the Python shell. If there is a lot of text, Python will put the help text into a *pager*, which lets you page up and down. Press the :kbd:`q` key to exit the pager.
de: Falls Du kreativ werden möchtest, kannst Du die geometrische Form mit den Funktionen ''turtle.width(...)'' und ''turtle.color(...)'' verändern. Wie kannst Du diese Funktionen verwenden? Bevor Du eine Funktion benutzen kannst, musst Du ihre *Signatur* (zum Beispiel die Anzahl und Bedeutung ihrer Parameter). Um das herauszufinden kannst Du in der interaktiven Python Shell ''help(turtle.color)'' eingeben. Falls sich dort eine grosse Menge Text befindet, schreibt Python den Hilfetext in einen *Pager*, in welchem Du auf- und abscrollen kannst. Drücke die Taste :kbd:'q' um den Pager wieder zu verlassen.

source: Are you seeing an error like this::
de: Siehst du ungefähr folgenden Fehler::
