Repository: OpenTechSchool/python-beginners
Catalog: source/_locales/*/LC_MESSAGES/pybeginners.po
Languages: de

source: Conditional Loops
de: Bedingte Schleifen

source: Introduction
de: Einführung

source: Conditional loops are way to repeat something until a certain condition is met. If the condition is never met, the loop can become infinite. In Python conditional loops are defined with the ``while`` statement::
de: Bedingte Schleifen sind ein Weg Instruktionen zu wiederholen bis eine bestimmte Bedingung eintritt. Falls die Bedingung nie eintritt, werden die Befehle in der Schleife ewig wiederholt. In Python werden bedingte Schleifen mit ``while`` ausgedrückt::

source: Turtle prison
de: Schildkrötengefängnis

source: Exercise
de: Übung

source: The turtle has been up to its usual tricks again, robbing liqour stores and building up huge gambling debts. It's time for turtle to be put into a box that it can't get out of.
de: Die Schildkröte hat wieder ihre übliche Masche durchgezogen, Schnapsläden ausgeraubt und gewaltige Spielschulden angehäuft. Es wird Zeit die Schildkröte hinter Gitter zu bringen, eine Kiste aus der sie nicht herauskommt.

source: Let's make a new version of ``forward()``. One that turns the turtle around if it tries to go further than 100 from the origin. We'll need a ``while`` loop, and some new turtle functions:
de: Lasst uns eine neue Versio von ''forward()'' entwickeln. Eine die die Schildkröte umdreht, sobald sie sich mehr als 100 vom Ursprungspunkt entfernt. Wir werden eine ''while'' Schleife brauchen, sowie einige neue turtle Befehle.

source: ``turtle.distance(0,0)`` - Distance of the turtle from the origin
de: ''turtle.distance(0, 0)'' - Entfernung der Schildkröte vom Ursprung.

source: ``turtle.towards(0,0)`` - The angle to get back to origin
de: ''turtle.towards(0, 0)'' - Der Winkel der zurück zum Ursprungspunkt führt.

source: ``turtle.setheading(angle)`` - Directly set the turtle direction
de: ''turtle.setheading(winkel)'' - Die Richtung der Schildkröte direkt setzen.

source: Now you will need to implement the prison logic using these turtle functions, a ``while`` loop and a bit of conditional logic. It's a bit of a stretch but keep at it! Don't be afraid to talk it out with a coach or another student.
de: Nun musst Du die Logik für das Gefängnis mit diesen turtle Funktionen implementieren, also eine ''while'' Schleife und einige konditionale Ausdrücke. Es gibt einiges zu tun, aber gib nicht auf! Frage ruhig einen der Coaches oder einen anderen Kursteilnehmer.

source: Solution
de: Lösung

source: Draw a spiral
de: Zeichne eine Spirale

source: Loops can be interrupted with the ``break`` statement. This is especially useful if you write an *infinite loop*, which is a loop where the conditional is always *True*.
de: Schleifen können mit der Anweisung ''break'' unterbrochen werden. Das ist besonders nützlich wenn Du eine Endlosschleife schreibst, also eine ''while'' Schleife in der die Abbruchbedingung immer *True* ist.

source: Write a ``while`` loop with a condition that is always *True* to draw a spiral. Interrupt the loop when the turtle reaches a certain distance from the center. Use the function ``turtle.distance(x, y)`` to get the turtle's distance to the point defined by the coordinates ``x`` and ``y``.
de: Schreibe eine ''while'' Schleife mit einer Bedingung die immer *True* ergibt, um eine Spirale zu zeichnen. Unterbreche die Schleife sobald die Schildkröte eine bestimmte Entfernung vom Mittelpunkt erreicht. Verwende die Funktion ''turtle.distance(x, y)'' um die Entfernung der Schildkröte zum Punkt mit den Koordinaten ''x'' und ''y'' zu erhalten.

source: To do this you will need the ``turtle.xcor()`` and ``turtle.ycor()`` functions, which return the position of the turtle in X and Y axes respectively.
de: Um das zu tun, brauchst Du die Funktionen ''turtle.xcor()'' und ''turtle.ycor()'', welche die Position der Schildkröte auf der X und Y-Achse zurückgeben.

source: To draw a spiral, the turtle has to rotate by a constant value and move forward by an increasing value.
de: Um eine Spirale zu zeichnen, muss die Schildkröte um einen konstanten Winkel gedreht werden und dabei um eine anwachsende Strecke vorwärts bewegt werden.

source: Can you make a conditional for this loop, so you don't need the infinite loop *while True* or the *break*? Which version do you find easier to understand?
de: Kannst du eine Bedingung für diese Schleife formulieren, so dass Du keine Endlosschleife *while True* oder die Anweisung *break* benötigst? Welche Variante findest Du einfacher zu verstehen?

source: Conditional statements
de: Verzweigungen

source: So far we have accomplished predefined tasks, but in all honesty we were accomplishing no better than old-time music boxes following one set of instructions to the end. What makes programming so much more powerful are conditional statements. This is the ability to *test* a variable against a value and act in one way if the condition is met by the variable or another way if not. They are also commonly called by programmers *if statements*.
de: Bisher haben wir vordefinierte Aufgaben erledigt, aber einmal ehrlich, die Programme waren kaum komplizierter als eine antike Drehorgel die eine vordefinierte Melodie vom Anfang bis zum Ende abspult. Verzweigugen sind das, was Programmieren sehr viel mächtiger macht. Verzweigungen *testen* den Inhalt einer Variablen und verhalten sich einmal so falls die Variable einen bestimmten Wert hat, und anders falls nicht. Programmierer nennen Verzweigungen auch *if Ausdrücke*.

source: To know if a condition is *True* of *False*, we need a new type of data: the booleans. They allow logical operations. A logic statement or operation can be evaluated to be *True* or *False*. Our conditional statement can then be understood like this:
de: Um zu wissen ob eine Bedingung *True* oder *False* ist, brauchen wir einen neuen Datentyp: Boolean. Booleans erlauben logische Operationen, die entweder als *wahr* oder *falsch* ausgewertet werden. Unsere Verzweigung kann also folgendermassen verstanden werden:

source: **if** *(a condition evaluates to True)*:
de: **if** (eine Bedingung die als True ausgewertet wird)*:

source: *then do these things only for 'True'*
de: *dann führe diese Anweisungen nur für 'True' aus*

source: *otherwise do these things only for 'False'*.
de: *andernfalls führe diese Anweisungen nur für 'False' aus*.

source: The condition can be anything that evaluates as *True* or *False*. Comparisons always return *True* or *False*, for example ``==`` (equal to), ``>`` (greater than), ``<`` (less than.)
de: Eine Bedingung kann alles sein, was zu wahr (*True*) oder falsch (*False*) evaluiert werden kann. Vergleiche ergeben immer wahr oder falsch, zum Beispiel ``==`` (ist gleich), ``>`` (größer als), ``<`` (kleiner als).

source: The **else** part is optional. If you leave it off, nothing will happen if the conditional evaluates to 'False'.
de: Der **else** Block ist optional. Falls Du ihn auslässt und die Bedingung als 'False' ausgewertet wird, passiert nichts weiter.

source: Examples
de: Beispiele

source: Here are some examples. You may want to read them over line-by-line and see what you think they do, or run them to be certain::
de: Hier sind einige Beispiele. Du kannst sie Zeile für Zeile lesen und nachdenken was sie tun, oder gleich ausführen um auf Nummer sicher zu gehen.

source: Giving Directions
de: Die Richtung festlegen

source: Python turtles can be very good at following instructions. Let's use the ``input()`` function to ask the user for a direction to move the turtle. To keep things easy we will only accept two instructions: "left" and "right".
de: Die Schildkröten in Python sind sehr gut darin, Befehle auszuführen. Lass uns die ''input()'' Funktion verwenden, um den Benutzer nach einer Richtung zu fragen, in die die Schildkröte bewegt werden soll. Um es nicht zu kompliziert zu machen, erlauben wir nur zwei Befehle: ''links'' und ''rechts''.

source: Using Python 2? The ``input()`` function is called ``raw_input()``.
de: Python 2 verwenden? Die Funktion ''input()'' heisst auch ''raw_input()''.

source: It's much easier to define this as a function, like so::
de: Es ist viel einfacher dies als eine Funktion zu definieren, etwa folgendermassen:

source: Now whenever you use ``move()`` you are prompted to choose ``left`` or ``right``.
de: Immer wenn Du nun ''move()'' verwendest, wirst Du gefragt entweder ''links'' oder ''rechts'' auszuwählen.

source: "data munging"
de: ''Datenbastelei''

source: In this program, the turtle will only respond to exactly ``left`` or ``right`` with no variation. Though ``Left`` or ``LEFT`` might seem the same as ``left`` to a human, that isn't the case when programming. Python has a few utility methods to help with that. A string has the methods ``.strip()``, which removes whitespace and ``.lower()`` which makes everything lower-case.
de: In diesem Programm wird die Schildkröte nur auf die Befehle ''links'' und ''rechts'' reagieren, ohne jegliche Abweichungen. Obwohl ''Links'' oder ''LINKS'' für einen Menschen das gleiche bedeutet wie ''links'', ist das für ein Programm nicht der Fall. Python hat einige Hilfsmethoden die dabei helfen. Ein String hat die Methoden ''.strip()'', die Leerzeichen und Zeilenumbrüche von den Enden entfernt, und ''.lower()'', welche den gesamten String in Kleinbuchstaben umwandelt.

source: Here are some examples to print out the effects of ``.strip()`` and ``.lower()``::
de: Here sind einige Beispiele, die die Auswirkungen von ''.strip()'' und ''.lower()'' illustrieren::

source: Try adding ``direction = direction.strip().lower()`` to the ``move()`` function, to see the effect. We often call this kind of code "data munging", and it is very common.
de: Versuche de Befehl ''direction = direction.strip().lower'' zu der Funktion ''move()'' hinzuzufügen. Beobachte die Auswirkungen. Diese Art von Code wird von uns ''data munging'' (Datenbastelei) genannt. Sie ist sehr häufig.

source: Can you add some extra input choices to make the turtle draw other things? How about ``hexagon``?
de: Kannst Du einig zusätzliche Eingabeoptionen hinzufügen, die die Schildkröte andere Dinge zeichnen lassen? Wie wäre es mit einem ''Sechseck''?

source: License
de: Lizenz

source: This work is licensed under the Creative Commons Attribution-ShareAlike 3.0 Unported License. To view a copy of this license, visit http://creativecommons.org/licenses/by-sa/3.0/ or send a letter to Creative Commons, 444 Castro Street, Suite 900, Mountain View, California, 94041, USA.
de: Dieses Werk steht unter einer `Creative Commons Namensnennung - Weitergabe unter gleichen Bedingungen 3.0 Deutschland Lizenz <http://creativecommons.org/licenses/by-sa/3.0/de>`_.

source: User-defined functions
de: Benutzerdefinierte Funktionen

source: There is still a lot of duplicated code --- the actual drawing of the rectangle --- around. If you need to copy and paste code, that is usually a sign of lacking abstractions. (Programmers call it a *code smell.*)
de: Es gibt immer noch eine Menge doppelten Code im Programm wie etwa das Zeichnen des Rechtecks. Falls Du Code kopieren und einfügen musst, ist das normalerweise ein Zeichen für fehlende Abstraktion. Programmierer nennen das auch *code smell* (miefender Code).

source: Functions are one way to express abstractions in Python. Let's take ``turtle.reset()`` for example. It is actually an abstraction for a number of steps, namely:
de: Funktionen sind ein Weg um Abstraktion in Python auszudrücken. Betrachten wir zum Beispiel ''turtle.reset''. Es ist eine Abstraktion für eine ganze Anzahl Zwischenschritte, nämlich:

source: Erase the drawing board.
de: Lösche die Zeichenfläche.

source: Set the width and color back to default.
de: Setze die Linienbreite und -Farbe zurück zu den Startwerten.

source: Move the turtle back to its initial position.
de: Bewege die Schildkröte in ihre Ausgangsposition zurück.

source: A function can be defined with the ``def`` keyword in Python::
de: Eine Funktion kann in Python mit dem Schlüsselwort ''def'' definiert werden::

source: This function we defined is called ``line_without_moving`` and it is an abstraction for two turtle steps - a move forward and a move backward.
de: Diese von uns definierte Funktion heisst ''line_without_moving''. Sie ist eine Abstraktion für zwei Bewegungen der Schildkröte - ein Schritt vorwärts und ein Schritt rückwärts.

source: To use it (or as it is usually called, "to call it"), write its name followed by parentheses::
de: Um sie zu benutzen (oder wie es häufig genannt wird, "sie aufzurufen"), schreib ihren Namen gefolgt von runden Klammern::

source: We could write more functions to remove some of the repetition::
de: Wir könnten mehr Funktionen implementieren, um einige der Wiederholungen loszuwerden::

source: Python uses *indenting with whitespace* to identify blocks of code that belong together. In Python a block (like the function definitions shown above) is introduced with a colon at the end of the line and subsequent commands are indented --- usually 4 spaces further in. The block ends with the first line that isn't indented.
de: Python benutzt *Einrückung mit Leerzeichen* um zusammengehörende Codeabschnitte zu kennzeichnen. Ein Block (wie die obige Funktion) wird in Python mit einem Doppelpunkt am Ende der Zeile und Einrückung der folgenden Zeilen --- üblicherweise vier Leerzeichen --- gekennzeichnet. Der Block endet sobald die Zeilen nicht mehr eingerückt sind.

source: This is different to many other programming languages, which use special characters (like curly braces ``{}``) to group blocks of code together.
de: Das ist ein Unterschied zu vielen anderen Programmiersprachen, die Sonderzeichen (etwa geschweifte Klammern ''{}'') verwenden um Codeblöcke zu kennzeichnen.

source: Never use tab characters to indent your blocks, only spaces. You can -- and should -- configure your editor to put 4 spaces when you press the tab key. The problem with using tab characters is that other python programmers use spaces, and if both are used in the same file python will read it wrong (in the best place, it will complain, and in the worst case, weird, hard to debug bugs will happen).
de: Verwende niemals Tabulatoren um Codeblöcke einzurücken, nur Leerzeichen. Du kannst -- und solltest -- Deinen Editor so konfigurieren, dass er vier Leerzeichen einsetzt sobald Du die Tab-Taste drückst. Das Problem mit den Tabulatoren ist, dass andere Programmierer Leerzeichen verwenden, und falls beide in der gleichen Python-Datei verwendet werden, wird Python sie fehlerhaft interpretieren. Im besten Fall gibt es eine Fehlermeldung und im schlimmsten Fall tauchen undurchsichtige schwer zu findende Fehler auf.

source: A function for a square
de: Eine Funktion für ein Viereck

source: Write a function that draws a square. Could you use this function to improve the tilted squares program? If you change the program to use a function, is it easier to experiment with?
de: Schreibe eine Funktion die ein Viereck zeichnet. Kannst du diese Funktion benutzen um das Programm mit den gekippten Vierecken zu verbessern? Lässt es sich leichter mit dem Programm experimentieren wenn du Funktionen benutzt?

source: Comments
de: Kommentare

source: In the solution above, the line that starts with a ``#`` is called a comment. In Python, anything that goes on a line after ``#`` is ignored by the computer. Use comments to explain what your program does, without changing the behaviour for the computer.
de: In der oben genannten Löung ist die Zeile die mit einem ''#'' anfängt, eine Kommentarzeile. In Python wird alles ignoriert was in der Zeile auf ein ''#'' folgt. Verwende Kommentare um zu erklären wie Dein Programm funktioniert, ohne dass Du dessen Verhalten im Computer veränderst.

source: Comments can also go at the end of a line, like this:
de: Kommentare dürfen ebenfalls am Zeilenende stehen, wie hier:

source: A function for a hexagon
de: Eine Funktion für ein Hexagon

source: Write a function that draws a hexagon.
de: Schreibe eine Funktion die ein Hexagon zeichnet.

source: Now combine that function into a honeycomb. Just make it with a single layer like this:
de: Jetzt kombiniere diese Funktion zu einer Honigwabe. Zeichne erst einmal nur eine einzige Ebene, ungefähr so:

source: You could also put the ``turtle.forward(100); turtle.right(60)`` portion in the function, but you better not call it ``hexagon`` in that case. That's misleading because it actually draws a hexagon and then advances to a position where another hexagon would make sense in order to draw a honeycomb. If you ever wanted to reuse your hexagon function outside of honeycombs, that would be confusing.
de: Du könntest auch die Befehle ''turtle.forward(100); turtle.right(60)'' in die Funktion stellen, aber in diesem Fall solltest Du die Funktion besser nicht ''hexagon'' nennen. Das wäre irreführend, da die Funktion dann nicht nur ein Sechseck zeichnen, sondern auch zur Position der nächsten Wabe vorrücken würde. Fall Du später die Funktion hexgon ausserhalb des Wabenprogramms verwenden möchtest wäre diese Namensgebung verwirrend.

source: Functions with parameters
de: Funktionen mit Parametern

source: As we shrink down our code and add functions to remove duplication, we are *factorizing* it. This is a good thing to do. But the functions we have defined so far are not very flexible. The variables are defined inside the function, so if we want to use a different angle or a distance then we need to write a new function.
de: Während wir unser Programm verkleinern und Funktionen hinzufügen um Duplikation zu vermeiden, *refaktorisieren* wir es. Dies ist eine gute Sache. Aber die Funktionen die wir bisher geschriebe haben sind nicht besonders flexibel. Die Variablen sind alle innerhalb der Funktion definiert, so dass wir jedes Mal eine neue Funktio schreiben müssen, falls wir einen anderen Winkel oder eine andere Strecke verwenden wollen.

source: That is why we need to be able to give parameters, also called *arguments*, to the function. This way the *variables* in the function can have different values each time we call the function:
de: Deshalb benötigen wir die Möglichkeit Parameter, auch *Argumente* genannt, an eine Funktion zu übergeben. So können die Variablen innerhalb der Funktion jedes Mal wenn die Funktion aufgerufen wird, andere Werte annehmen:

source: Remember how we defined the function ``line_without_moving()`` in the previous section::
de: Erinnere Dich wie wir die Funktion ''line_without_moving()'' im vorigen Abschnitt definiert haben::

source: We can improve it by giving it a parameter::
de: Wir können die Funktion verbessern, indem wir ihr einen Parameter übergeben::

source: The parameter acts as a *variable* only known inside the function's definition. We use the newly defined function by calling it with the value we want the parameter to have like this::
de: Der Parameter fungiert als *Variable* die nur innerhalb der Funktionsdefinition bekannt ist. Wir verwenden diese neu definierte Funktion, indem wir sie mit dem Wert für den Parameter aufrufen::

source: We have been using functions with parameters since the beginning of the tutorial with ``turtle.forward()``, ``turtle.left()``, etc...
de: Wir haben bereits seit dem Anfang des Tutorials Funktionen mit Parametern verwendet, z.B. ''turtle.forward()'', ''turtle.left()'', etc...

source: And we can put as many arguments (or parameters) as we want, separating them with commas and giving them different names::
de: Wir können so viele Argumente (oder Parameter) wie wir möchten für eine Funktio definieren. Die einzelnen Argumente sind dabei durch Kommata getrennt und haben alle unterschiedliche Namen::

source: A parameterized function for a variable size hexagon
de: Eine parametrisierte Funktion für ein Hexagon mit variabler Grösse

source: Write a function that allows you to draw hexagons of any size you want, each time you call the function.
de: Schreibe eine Funktion die Dir jedes Mal wenn Du die Funktion aufrufsts, erlaubt Hexagone mit beliebiger Grösse zu zeichnen.

source: A function of several parameters
de: Eine Funktion mit mehreren Parametern

source: Write a function that draws a honeycomb with a variable number of hexagons, of variable sizes.
de: Schreibe eine Funktion die eine Honigwabe mit einer variablen Anzahl Hexagone von unterschiedlicher Grösse zeichnet (*sollen alle Hexe in einer Wabe die gleiche Grösse haben* A.d.Ue)

source: Getting started
de: Erste Schritte

source: If you haven't yet got python, the latest official installation packages can be found here:
de: Falls Du Python noch nicht installiert hast, findest Du die jüngsten offiziellen Installationspakete hier:

source: Python 3 is preferable, being the newest version out!
de: Python 3 ist zu bevorzugen, da es die neueste verfügbare Version ist!

source: What is Python, exactly?
de: Was ist Python eigentlich?

source: Ok, so python is this thing called a **programming language**. It takes text that you've written (usually referred to as **code**), turns it into instructions for your computer, and runs those instructions. We'll be learning how to write code to do cool and useful stuff. No longer will you be bound to use others' programs to do things with your computer!
de: Also, Python ist etwas dass **Programmiersprache** genannt wird. Es liest Text ein den Du geschrieben hast (üblicherweise genannt **code**), verwandelt ihn in Befehle für den Computer und führt diese aus. Wir werden lernen, Code zu schreiben der coole und nützliche Dinge tut. Du wirst nicht länger daran gebunden sein, Programme von anderen Leuten zu verwenden um mit Deinem Computer Dinge zu tun.

source: Practically, Python is just another program on your computer. The first thing to learn is how to use and interact with it. There are in fact many ways to do this; the first one to learn is to interact with python's interpreter, using your **operating system's** (OS) console.
de: Python ist praktisch einfach ein weiteres Programm auf Deinem Computer. Zuerst werden wir lernen Python zu benutzen und mit ihm zu interagieren. Es gibt mehrere Wege das zu tun; der erste ist mit dem Python Interpreter über die Textkonsole Deines **Betriebssystems** zu interagieren.

source: A **console** (or 'terminal', or 'command prompt') is a *textual* way to interact with your OS, just as the 'desktop', in conjuction with your mouse, is the *graphical* way to interact your system.
de: Eine **Konsole** (auch 'Terminal' oder 'Prompt') ist ein *schriftlicher* Weg mit Deinem Betriebssystem zu interagieren, so wie der 'Desktop' zusammen mit Deiner Maus ein *grafischer* Weg zu Deinem System ist.

source: Opening a console on Mac OS X
de: Eine Konsole auf Mac OS X öffnen

source: OS X's standard console is a program called Terminal. Open Terminal by navigating to Applications, then Utilities, then double-click the "Terminal" program. You can also easily search for it in the system search tool in the top right.
de: OS X hat standardmässig eine Konsole genannt Terminal eingebaut. Du kannst das Terminal öffnen, indem Du nach Applications gehst, dann nach Utilities, und dann das ''Terminal''-Programm doppelklickst. Du kannst auch einfach mit dem Suchwerkzeug in der rechten oberen Ecke danach suchen.

source: The command line Terminal is a tool for interacting with your computer. A window will open with a command line prompt message, something like this::
de: Das Kommandozeilenterminal ist ein Werkzeug um mit Deinem Computer zu interagieren. Ein Fenste mit einer Nachricht und einem Prompt öffnet sich, ähnlich zu folgendem:

source: Opening a console on Linux
de: Eine Konsole unter Linux öffnen
