Repository: OpenTechSchool/python-beginners
Catalog: source/locale/*/LC_MESSAGES/conditionals.po
Languages: es_cl, ko, ro, ru

source: Conditional statements
es_cl: Sentencias Condicionales
ko: 조건문
ro: Instrucțiuni condiționale
ru: Условные операторы

source: Introduction
es_cl: Introducción
ko: 소개
ro: Introducere
ru: Введение

source: So far we have accomplished predefined tasks, but in all honesty we were accomplishing no better than old-time music boxes following one set of instructions to the end. What makes programming so much more powerful are conditional statements. This is the ability to *test* a variable against a value and act in one way if the condition is met by the variable or another way if not. They are also commonly called by programmers *if statements*.
es_cl: Hasta ahora hemos completado tareas pre-definidas, pero para ser honestos no hemos conseguido hacer nada mejor que lo que hacían aquellas viejas cajas de música que siguen un conjunto de instrucciones hasta el final. Lo que hace a la programación mucho más poderosa son las sentencias condicionales. Esta es la habilidad de *probar* una variable contra otra variable y actuar de una forma si se cumple una condición o de otra si no se cumple. Ellas son comúnmente llamadas por los programadores como *sentencias if*.
ko: 이미 한참 앞에서 정해진 과제를 해결했지만, 솔직히 말해서 하나의 명령 모음을 처음부터 끝까지 따라가는 오래된 뮤직 박스 그 이상까진 가지 않았습니다. 프로그래밍을 더욱 강력하게 해주는 요소는 조건문입니다. 값에 대하 변수를 *시험* 하는 능력이 있으며 변수에 대한 조건을 만날 경우 한 방식대로 동작하고 그렇지 않으면 다른 방식으로 동작합니다. 프로그래머들이 보통 부르기로는 *if 조건문*이라고 합니다.
ro: Până acum am îndeplinit sarcini predefinite, dar la modul serios nu am făcut decât ce face un casetofon care urmează redă același lucru de fiecare dată. Ceea ce face programarea atât de puternică sunt instrucțiunile condiționale. Este facilitatea de a *testa* o variabilă față de o valoare și de a reacționa într-un fel dacă condiția este îndeplinită de variabilă și în alt fel dacă nu. Acestea sunt în mod normal denumite de programatori *instrucțiuni if*.

source: To know if a condition is *True* of *False*, we need a new type of data: the booleans. They allow logical operations. A logic statement or operation can be evaluated to be *True* or *False*. Our conditional statement can then be understood like this:
es_cl: para saver si una condición es *Verdadera* o *Falsa*, necesitamos un nuevo tipo de datos: los booleanos. Ellos permiten realizar operaciones lógicas. Una sentencia u operación lógica puede ser evaluada para ser *Verdadera* o *Falsa*. Nuestra sentencia condicional se puede entender como sigue:
ko: 조건이 *True*인지 *False*인지 알려면, 새 데이터 형식 부울린이 필요합니다. 부울린 형식은 논리 연산자를 허용합니다. 논리 구문 또는 논리 연산자는 *True* 또는 *False*로 계산할 수 있습니다. 조건문은 다음과 같이 이해할 수 있습니다:
ro: Pentru a ști dacă condiția este *Adevărată* sau *Falsă* avem nevoie de un nou tip de date: logice. Acestea permit operații logice. O instrucțiune sau operație logică poate fi evaluată la *Adevărat* sau *Fals*. Instrucțiunea noastră condițională poate fi înțeleasă ca:
ru: Чтобы узнать, *истинно* или *ложно* условие, нужен новый тип информации: логический (булевый), описываемый логическими операторами. Любое логическое значение или логическая операция могут быть оценены как "истина" или "ложь". Условные выражения следует понимать так:

source: **if** *(a condition evaluates to True)*:
es_cl: **if** *(la condición resulta Verdadera)*:
ko: **if** *(참인지 판단할 조건)*:
ro: **dacă** *(o condiție este Adevărată)*:
ru: **if** *(условие истинно)*:

source: *then do these things only for 'True'*
es_cl: *entonces hacer esto sólo para 'Verdadero'*
ko: *'True'일 경우에만 아래 구문을 실행*
ro: *atunci execută aceste lucruri doar pentru 'Adevărat'*
ru: *делать это*

source: **else**:
ro: **altfel**:

source: *otherwise do these things only for 'False'*.
es_cl: *de otra forma hacer esto solo para 'Falso'*.
ko: *그렇지 않을 경우 'False'일 경우에만 아래 구문을 실행합니다*.
ro: *altfel fă aceste lucruri numai pentru 'Fals'*.
ru: *в противном случае делать это*

source: The condition can be anything that evaluates as *True* or *False*. Comparisons always return *True* or *False*, for example ``==`` (equal to), ``>`` (greater than), ``<`` (less than.)
es_cl: La condición puede ser cualquier cosa que sea evaluada como *Verdadero* o *Falso*. Comparaciones siempre retornan *Verdadero* o *Falso*, por ejemplo ``==`` (igual a), ``>`` (mayor que), ``<`` (menor que).
ko: 조건문은 *True* 또는 *False*의 값을 판단하는 그 어떤 동작이든 취할 수 있습니다. 비교문은 항상 *True* 또는 *False* 를 반환하는데, 비교 연산자의 예로는 ``==`` (같음), ``>`` (보다 큼), ``<`` (보다 작음)이 있습니다.
ro: Condiția poate fi orice se evaluează la *Adevărat* sau *Fals*. Comparațiile întotdeauna întorc *Adevărat* sau *Fals*, de exemplu ``==`` (este egal cu), ``>`` (mai mare decât), ``<`` (mai mic decât).
ru: Условие может быть любым, имея значение *истина* или *ложь*. В результате сравнений (таких как ``==`` (равнозначно), ``>`` (больше чем), ``<`` (меньше чем)) всегда возвращается логическое значение.

source: The **else** part is optional. If you leave it off, nothing will happen if the conditional evaluates to 'False'.
es_cl: La parte **else** es opcional. Si usted no la coloca, nada sucederá si la condición resulta ser 'Falsa'.
ko: **else** 부분은 선택적입니다. 비워두면 조건의 결과로 'False'가 나왔을 때 아무일도 일어나지 않습니다.
ro: Partea **else** este opțională. Dacă nu o folosești, atunci când condiția are valoarea 'Fals' nu se va întâmpla nimic.
ru: Часть **else** необязательна. Если убрать её, при ложном значении ничего не произойдёт.

source: Examples
es_cl: Ejemplos
ko: 예제
ro: Exemple
ru: Примеры

source: Here are some examples. You may want to read them over line-by-line and see what you think they do, or run them to be certain::
es_cl: Acá hay algunos ejemplos. Puede querer leerlos línea-a-línea y ver que cree usted que hacen, o ejecutarlos para estar seguro::
ko: 몇 가지 예제를 보여드리겠습니다. 한줄 한줄 읽어보시고 어떤 동작을 하는지 보시든지, 각 부분을 실행해보십시오::
ro: Iată câteva exemple. Poți să le citești linie cu linie și să te gândești ce fac, sau poți să le execuți pentru a fi sigur::
ru: Немного примеров. Можешь просмотреть их построчно и попытаться понять, что они делают (или запустить, чтобы быть уверенным)::

source: Giving Directions
es_cl: Dando direcciones
ko: 방향 지시하기
ro: Cum să dai indicații

source: Python turtles can be very good at following instructions. Let's use the ``input()`` function to ask the user for a direction to move the turtle. To keep things easy we will only accept two instructions: "left" and "right".
es_cl: Las tortugas de Python son muy buenas siguiendo instrucciones. Usemos la función ``input()`` para preguntar al usuario la dirección en la que se mueve la tortuga. Para que sea fácil, sólo aceptaremos dos instrucciones: "left" y "right".
ko: 파이선 거북이는 다음 지시를 매우 잘 따르는 존재가 될 수 있습니다. 거북이가 움직이는 방향을 사용자가 요청할 수 있는 ``input()`` 함수를 사용해보도록 하겠습니다. 쉽게 하기 위해 "left"와 "right" 두가지 명령만 받아들이도록 하겠습니다.
ro: Țestoasele din Python pot fi foarte bune la executat instrucțiuni. Hai să încercăm să folosim funcția ``input()`` pentru a cere utilizatorului o direcție în care să miște țestoasa. Pentru a păstra lucrurile simple vom accepta doar două instrucțiuni: "left" (stânga) și "right" (dreapta).
ru: Python-черепашка хорошо работает с последовательными указаниями. Давайте с помощью функции ``input()`` будем принимать команды от пользователя, которые указывают направление движения черепашки. Чтобы не усложнять программу, предусмотрим только 2 инструкции: "налево" и "направо".

source: Using Python 2? The ``input()`` function is called ``raw_input()``.
es_cl: Usa Python 2? La función ``ìnput()`` se llama ``raw_input()``.
ko: 파이썬 2를 사용하시나요? ``input()`` 함수는 ``raw_input()``함수를 호출합니다.
ro: Folosești Python 2? Funcția ``input()`` se numește ``raw_input()``.
ru: Используешь Python 2? Функция ``input()`` называется ``raw_input()``.

source: It's much easier to define this as a function, like so::
es_cl: Es mucho más fácil definir esto como una función, entonces::
ko: 다음과 같이 함수를 정의하는 것처럼 매우 쉽습니다::
ro: Este mult mai ușor să definești asta ca o funcție, adică::
ru: Намного проще выделить это в функцию, вот так::

source: Now whenever you use ``move()`` you are prompted to choose ``left`` or ``right``.
es_cl: Ahora cada vez que use ``move()`` se le solicita que escoja ``left`` o ``right``.
ko: 이제 ``move()``를 언제든지 사용할 때마다 ``left``나 ``right``를 택하도록 질문을 받을 것입니다.
ro: Acum oricând folosești ``move()`` ți se va cere să alegi ``left`` (stânga) sau ``right`` (dreapta).
ru: Теперь, используя ``move()``, ты можешь выбрать, в какую сторону двигаться: влево (``left``) или вправо (``right``).

source: "data munging"
ko: "데이터 은폐"
ro: "prelucrarea datelor"
ru: Преобразование данных ("data munging")

source: In this program, the turtle will only respond to exactly ``left`` or ``right`` with no variation. Though ``Left`` or ``LEFT`` might seem the same as ``left`` to a human, that isn't the case when programming. Python has a few utility methods to help with that. A string has the methods ``.strip()``, which removes whitespace and ``.lower()`` which makes everything lower-case.
es_cl: En este programa la tortuga responderá sólo a las palabras exactas ``left`` o ``right`` sin variaciones. Entonces ``Left`` o ``LEFT`` pueden parecer iguales a ``left`` para un humano, pero ese no es el caso en programación. Python tiene algunos métodos útiles para ayudarnos con esto. Un método de strings llamado ``.strip()``, el cual elimina espacios en blanco y ``.lower()`` el cual transforma todo a minúsculas.
ko: 이 프로그램에서, 거북이는 다른 예외없이 정확하게 ``left`` 또는 ``right``에만 반응합니다. ``Left`` 또는 ``LEFT``는 사람에게 있어 같은 ``left``겠지만 프로그래밍을 할 경우에는 그렇지 않습니다. 파이썬에는 이런 상황에 도움을 줄 몇가지 쓸모있는 메서드가 있습니다. 문자열은 공백을 제거할때 사용하는 ``.strip()`` 메서드와 모든 글자를 소문자로 만드는 ``.lower()`` 메서드를 보유하고 있습니다.
ro: În acest program, țestoasa va răspunde doar la exact ``left`` sau ``right``, fără excepție. Deși ``Left`` sau ``LEFT`` ar putea părea același lucru ca și ``left`` pentru un om, asta nu e valabil și în cazul programării. Python are niște metode care să te ajute la asta. Un șir ce caractere are metodele ``.strip()``, care elimină spațiile albe și ``.lower()`` care transformă toate literele în litere mici.

source: Here are some examples to print out the effects of ``.strip()`` and ``.lower()``::
es_cl: Acá hay algunos ejemplos para imprimir los efectos de ``.strip()`` y ``.lower()``::
ko: ``.strip()``과 ``.lower()``의 결과를 출력하는 간단한 예제를 보여드리겠습니다::
ro: Iată câteva exemple care afișează efectele lui ``.strip()`` și ``.lower()``::
ru: Немного примеров, демонстрирующих работу ``.strip()`` и ``.lower()``::

source: Try adding ``direction = direction.strip().lower()`` to the ``move()`` function, to see the effect. We often call this kind of code "data munging", and it is very common.
es_cl: Intente agregar la sentencia ``direction = direction.strip().lower()`` a la función ``move()``, para ver su efecto. A menudo llamamos este tipo de código "data munging", y es muy común.
ko: 같은 결과를 보기 위해 ``move()`` 함수에 ``direction = direction.strip().lower()``를 추가해보십시오. 이런 코드를 종종 "데이터 은폐"라고 하며, 매우 일반적으로 사용합니다.
ro: Încearcă să adaugi ``direction = direction.strip().lower()`` la funcția ``move()``, pentru a vedea ce efect are. Adeseori numim genul acesta de cod "data munging" (prelucrarea datelor), și este foarte des întâlnit.
ru: Попробуй добавить ``direction = direction.strip().lower()`` в функцию ``move()`` и посмотри, что получилось. Это называется преобразованием данных ("data munging") и очень часто используется в различных программах.

source: Can you add some extra input choices to make the turtle draw other things? How about ``hexagon``?
es_cl: puede agregar algunas opciones extra para que la tortuga dibuje otras cosas? Que tal ``hexagon``?
ko: 거북이가 다른걸 그릴 수 있게 추가 입력 선택을 넣을 수 있겠나요? ``hexagon``은 어떤가요?
ro: Poți să adaugi opțiuni suplimentare pentru a face țestoasa să deseneze și alte lucruri? Ce zici de ``hexagon``?
ru: Можешь ли ты добавить дополнительные варианты движения, чтобы черепашка рисовала другие фигуры? Как насчёт шестиугольника?
