Repository: OpenTechSchool/python-beginners
Catalog: source/locale/*/LC_MESSAGES/conditional_loops.po
Languages: ko, ro, ru

source: Conditional Loops
ko: 조건 순환 반복
ro: Bucle condiționale
ru: Условные циклы

source: Introduction
ko: 소개
ro: Introducere
ru: Введение

source: Conditional loops are way to repeat something while a certain condition is satisfied, or **True**. If the condition is always satisfied (never becomes **False**), the loop can become infinite. If the condition starts off false, the code in the loop will never run! In Python conditional loops are defined with the ``while`` statement::
ko: 조건 순환 반복은 각각의 경우에 조건이 만족하거나 **True**일 때 어떤 동작을 반복하는 방법이예요. 상태가 항상 만족한다면(**False**가 되지 않는다면), 순환 반복은 끝남이 없을 수 있어요. False 조건으로 시작하면 순환 반복 구문 안의 코드는 실행되지 않아요! 파이썬에서는 조건 순환 반복 구문을 ``while`` 구문으로 정의해요::
ro: Buclele condiționale sunt un mod de a repeta ceva atâta vreme cât o condiție este satisfăcută, sau **Adevărată**. Dacă condiția este întotdeauna satisfăcută (nu devine niciodată **Falsă**), atunci bucla poate deveni infinită. Dacă condiția este falsă la început, codul din buclă nu va rula niciodată! În Python buclele condiționale sunt definite folosind declarația ``while``:
ru: Условные циклы необходимы для повторения каких-либо действий в зависимости от логического значения условия. Если значение условия всегда остаётся положительным, то цикл может быть бесконечным, если оно с самого начала отрицательно, то цикл не будет выполнен. В Python условные циклы создаются с помощью оператора ``while``.

source: We call this part of the code the 'conditional': ``'.' not in word``
ko: 이 코드 일부를 '조건문' 이라고 해요: ``'.' 은 단어에 없어요``
ro: Numim această parte a codului 'condițional': ``'.' not in word``

source: Whether the conditional return True or not determines whether the code inside the ``while`` loop runs.
ko: 조건문이 True를 반환하느냐 마느냐에 따라 ``while`` 순환 반복 구문 안에 있는 코드를 실행할지 말지를 결정해요.
ro: De valoarea Adevărat sau nu întoarsă de condiție depinde executarea codului din bucla ``while``.

source: Read the code above, and see if you can summarise in your head what it what it do (what its final output will be).
ko: 위의 코드를 보고, 어떤 동작을 할 지 머릿속에 정리해본 내용을 확인해보세요(마지막 결과가 어떻게 될지요).
ro: Citește codul de mai sus și încearcă să rezumi în minte ce face (care va fi rezultatul final).
ru: Прочитай расположенный выше код и попробуй разобраться, что он делает (т. е. что будет сделано в результате его работы).

source: Then copy it into a file, say :file:`sentence.py` and run it - see exactly what it does. Does that match up with what you thought?
ko: 그 다음 파일에 복사해넣고 :file:`sentence.py`를 불러서 실행해보세요. 정확하게 어떤 동작을 하는지 보세요. 생각한대로 동작하나요?
ro: Apoi copiază într-un fișier, cum ar fi :file:`sentence.py` și rulează-l - vezi exact ce face. Seamănă cu ce credeai tu ?
ru: Затем скопируй этот код в файл (например, :file:`sentence.py`), запусти, и проверь свои догадки.

source: If you are using Python 2, you will need to replace ``input`` with ``raw_input`` to run the program correctly.
ko: 파이썬 2를 사용하면, 프로그램을 올바르게 돌아가게 하려면 ``input``을 ``raw_input``으로 바꾸셔야 해요.
ro: Dacă folosești Python 2, atunci trebuie să înlocuiești ``input`` cu ``raw_input`` pentru ca programul să se execute corect.
ru: Если ты используешь Python 2, замени ``input`` на ``raw_input`` для корректной работы программы.

source: Turtle prison
ko: 거북이 감옥
ro: Închisoarea țestoasei
ru: Тюрьма для черепашки

source: Exercise
ko: 연습
ro: Exercițiu
ru: Упражнение

source: The turtle has been up to its usual tricks again, robbing liqour stores and building up huge gambling debts. It's time for turtle to be put into a cell that it can't get out of.
ko: 거북이가 술집에서 술을 훔쳐오고 엄청난 도박빚을 몰고 오는 사기를 치기 시작했어요. 이 거북이를 밖으로 나오지 못하게 공간에 집어넣을 시간입니다.

source: Let's make a new version of ``forward()``. One that will turn the turtle around if it tries to go further than 100 from the origin. We'll need a ``while`` loop, and some new turtle functions:
ko: ``forward()``를 새로 짜기로 해요. 새로 작성한 함수는 거북이가 원점으로부터 100 이상 가면 돌아오게 합니다. ``while`` 순환 반복 구문과 몇가지 거북이 함수가 필요해요:
ro: Hai să facem o nouă variantă de ``forward()``. Una care va întoarce țestoasa complet dacă încearcă să meargă mai departe de 100 de la origine. Vom avea nevoie de o buclă ``while`` și de cateva funcții noi:
ru: Давайте сделаем новую версию ``forward()``, которая будет поворачивать черепашку, если она слишком далеко (более, чем на 100) отойдёт от начала координатной сетки. . Нам понадобится цикл ``while`` и несколько новых функций для черепашки:

source: ``turtle.distance(0,0)`` - Distance of the turtle from the origin
ko: ``turtle.distance(0,0)`` - 원점으로부터 거북이까지의 거리예요
ro: ``turtle.distance(0,0)`` - Distanța țestoasei de la origine
ru: ``turtle.distance(0,0)`` - Расстояние до черепашки от начала координат

source: ``turtle.towards(0,0)`` - The angle to get back to origin
ko: ``turtle.towards(0,0)`` - 거북이가 놓인 방향을 바로 설정해요
ro: ``turtle.towards(0,0)`` - Unghiul pentru a se întoarce la origine
ru: ``turtle.towards(0,0)`` - Градусная мера угла для возвращения к началу координат

source: ``turtle.setheading(angle)`` - Directly sets the turtle direction
ko: ``turtle.setheading(angle)`` - 원점으로부터의 각도예요
ro: ``turtle.setheading(angle)`` - Setează direcția țestoasei
ru: ``turtle.setheading(angle)`` - Ручная установка направления черепашки

source: You could try playing with a turtle in the interpreter and using these functions to check exactly what they do, if you like.
ko: 인터프리터에서 거북이를 가지고 놀아볼 수 있고, 원할 경우 함수를 이용하여 거북이가 어떤 행동을 하는지 확인해볼 수 있어요.
ro: Poți să încerci să te joci cu țestoasa direct în interpretor pentru a verifica exact ce fac, daca dorești.

source: Now you will need to implement the prison logic using these turtle functions, perhaps a ``while`` loop and a bit of conditional logic. It's a bit of a stretch but keep at it! Don't be afraid to talk it out with a coach or another student.
ko: 거북이 함수를 사용해서 감옥 로직을 구현해야 할텐데요. 아마 ``while`` 순환 반복 구문과 약간의 상태 로직을 사용하면 될거예요. 좀 늘어날텐데 그냥 그대로 두세요! 도우미나 다른 학생과 이야기하는걸 두려워하지 마세요.
ro: Acum va trebui să implementăm logica celulei, poate într-o buclă ``while`` și folosind niște logică condițională. Este puțin cam complicat dar continuă! Să nu îți fie frică să vorbești cu cineva mai experimentat sau cu alt student.

source: Solution
ko: 해결책
ro: Soluția
ru: Решение

source: Draw a spiral
ko: 원 그리기
ro: Desenează o spirală
ru: Нарисуй спираль

source: Loops can be interrupted with the ``break`` statement. This is especially useful if you write an *infinite loop*, which is a loop where the conditional is always **True**.
ko: 순환 반복 구문은 ``break``문으로 멈출 수 있어요. 조건이 항상 **True**인 순환 반복이 존재하는 *무한 순환 반복* 구문을 작성했을때 특히 쓸모가 있어요.
ro: Buclele pot fi întrerupte cu comanda ``break``. Este util în mod special când ai scris o *buclă infinită*, care este o buclă unde condiția este întotdeauna **Adevărată**.
ru: Циклы могут быть прерваны командой ``break``. Она особенно полезна, если ты пишешь *бесконечный цикл*, т.е. цикл, условие которого всегда истинно.

source: Write a ``while`` loop with a condition that is always **True** to draw a spiral. Interrupt the loop when the turtle reaches a certain distance from the center. Use the function ``turtle.distance(x, y)`` to get the turtle's distance to the point defined by the coordinates ``x`` and ``y``.
ko: ``while`` 순환 반복 구문에 원을 그릴때 조건문이 항상 **True**가 되도록 작성하세요. 가운데에서 일정 거리에 도달하면 순환 반복 구문을 멈추세요. 원점으로부터 ``x``와 ``y`` 좌표로 정의한 점까지의 거리를 가져오려면 ``turtle.distance(x, y)`` 함수를 사용하세요.
ro: Scrie o buclă ``while`` cu o condiție care este întotdeauna **Adevărată** pentru a desena o spirală. Întrerupe bucla când țestoasa ajunge la o anumită distanță față de centru. Folosește funcția ``turtle.distance(x, y)`` pentru a afla distanța țestoasei față de punctul definit de coordonatele ``x`` și ``y``.
ru: Напиши ``while``-цикл для рисования спирали, условие которого всегда будет выполняться (т.е. бесконечный цикл), с прекращением выполнения по достижении черепашкой определённого расстояния от центра. Используй функцию ``turtle.distance(x, y)``, чтобы получить расстояние от черепашки до заданной точки.

source: To do this you will need the ``turtle.xcor()`` and ``turtle.ycor()`` functions, which return the position of the turtle in X and Y axes respectively.
ko: 이 동작을 취하려면 거북이의 X축 Y축 각각의 위치를 반환하는 ``turtle.xcor()`` 와 ``turtle.ycor()`` 함수가 필요해요.
ro: Pentru a face asta ai nevoie de funcțiile ``turtle.xcor()`` și ``turtle.ycor()``, care returnează poziția țestoasei pe axele X si respectiv Y.
ru: Чтобы сделать это, понадобятся функции ``turtle.xcor()`` и ``turtle.ycor()``, которые возвращают координаты (черепашки) X и Y соответственно.

source: To draw a spiral, the turtle has to rotate by a constant value and move forward by an increasing value.
ko: 원을 그리려면 거북이가 상수값에 따라 돌아야 하고 값 증가에 따라 앞으로 이동해야 해요.
ro: Pentru a desena o spirală, țestoasa trebuie să se rotească cu o valoare constantă și să înainteze cu o valoare din ce în ce mai mare.
ru: Чтобы нарисовать спираль, черепашка должна поворачиваться на неизменяемую величину и двигаться вперёд на постоянно увеличивающееся расстояние

source: Bonus
ko: 덤
ro: Supliment
ru: Дополнительно

source: Can you make a conditional for this loop, so you don't need the infinite loop ``while True`` or the ``break``? Which version do you find easier to understand?
ko: 이 순환 반복 구문에 조건문을 넣어서 ``while True`` 또는 ``break``를 사용한 무한 순환 반복 구문이 필요없게 할 수 있나요? 어떤 버전이 쉽게 이해할 수 있는 버전일까요?
ro: Poți să creezi o condiție pentru această buclă, în așa fel încât să nu ai nevoie de bucla infinită ``while True`` sau de ``break``? Ce versiune este mai ușor de înțeles?
