Repository: OpenTechSchool/python-beginners
Catalog: source/locale/*/LC_MESSAGES/functions_parameters.po
Languages: es_cl, ko, ro, ru

source: Functions with parameters
es_cl: Funciones con parámetros
ko: 매개 변수가 있는 함수
ro: Funcții cu parametri
ru: Функции с параметрами

source: Introduction
es_cl: Introducción
ko: 소개
ro: Introducere
ru: Введение

source: As we shrink down our code and add functions to remove duplication, we are *factorizing* it. This is a good thing to do. But the functions we have defined so far are not very flexible. The variables are defined inside the function, so if we want to use a different angle or a distance then we need to write a new function. Our hexagon function can only draw one size of hexagon!
es_cl: A medida que reducimos nuestro código y removemos sentencias duplicadas, lo estamos *factorizando*. Esto es muy bueno. Pero las funciones que hemos definido hasta ahora no son muy flexibles. Las variables están definidas dentro de la función, entonces, si queremos usar un ángulo o distancia diferentes necesitamos escribir una nueva función. Nuestra función hexagon sólo puede dibujar hexágonos de un solo tamaño!
ko: 반복되는 코드를 제거하기 위해 코드를 함수에 넣은 상태로 함수를 추가하는 것처럼, 코드를 *정리* 하겠어요. 하면 좋은 일인데 정의한 함수는 그리 썩 유연하진 않아요. 변수는 함수 안에 정의했기 때문에 각각 다른 값의 각이나 거리를 사용하려고 하면 새 함수를 작성해야 하거든요. 육각형 함수는 한가지 크기의 육각형만 그려요!
ro: Pe măsură ce reducem codul și adăugăm funcții pentru a elimina duplicarea, îl *factorizăm*. Ăsta este un lucru bun. Dar funcțiile pe care le-am creeat până acum nu sunt foarte flexibile. Variabilele sunt definite în cadrul funcției, așa că dacă vrem să folosim un alt unghi sau altă distanță atunci trebuie să scriem o nouă funcție. Funcția noastră hexagon poate desena doar o singură dimensiune de hexagon!
ru: Мы уменьшаем количество нашего кода и добавляем функции, что бы избежать повторений - это называется *рефакторинг*. Рефакторинг крайне полезен. Ведь функции, которые мы определили не очень "гибкие". Необходимые значения заданы внутри функций и если мы захотим изменить угол или дистанцию - нам прийдеться писать новую функцию. Наша функция для рисования шестиугольников может рисовать шестиугольники только одного размера!

source: That is why we need to be able to give parameters, also called *arguments*, to the function. This way the *variables* in the function can have different values each time we call the function:
es_cl: Es por esto que necesitamos poder entregar parámetros, tambien llamados *argumentos*, a la función. De esta forma las *variables* en la función pueden tener valores diferentes cada vez que llamemos a la función:
ko: 이게 왜 매개 변수를 함수에 주어야 하느냐에 대한 이유인데, 매개 변수는 *인자*라고도 해요. 이 방법을 통해 함수 안의 *변수*에 함수를 호출할 때 매번 다른 값을 줄 수 있어요:
ro: Din acest motiv avem nevoie să putem transmite funcției parametri, numiți și *argumente*. În acest mod *variabilele* din cadrul funcției pot avea diverse valori la fiecare apel al funcției.
ru: Поэтому у нас должна быть возможность задавать параметры функции, которые также называют *аргументами*. В таком случае *переменные* в функции могут принимать разные значения кождый раз, когда мы вызываем нашу функцию::

source: Remember how we defined the function ``line_without_moving()`` in the previous section::
es_cl: Recuerde como definimos la función ``line_without_moving()`` en la sección anterior::
ko: 앞의 장에서 ``line_without_moving()`` 함수를 어떻게 정의했는지 기억해보세요::
ro: Iată cum am definit funcția ``line_without_moving()`` în secțiunea precedentă:
ru: Вспомни, как мы описали функцию ``line_without_moving()`` в предыдущей главе::

source: We can improve it by giving it a parameter::
es_cl: Podemos mejorarla dándole un parámetro::
ko: 여기에 매개 변수를 주어 구현할 수도 있어요::
ro: O putem îmbunătăți transmițându-i un parametru:
ru: Мы можем улучить её используя параметр::

source: The parameter acts as a *variable* only known inside the function's definition. We use the newly defined function by calling it with the value we want the parameter to have like this::
es_cl: El parámetro actúa como una *variable* sólo conocida dentro de la definición de la función. Podemos usar la nueva función definida llamándola con el valor que queremos que tenga el parámetro, por ejemplo::
ko: 매개 변수는 함수 내부에 정의한 걸로 알려진 *변수* 처럼 동작해요. 새로 정의한 함수는 매개 변수에 넣으려는 값으로 호출하는 방법을 통해 다음 처럼 사용해요::
ro: Parametrul se comportă ca o *variabilă* vizibilă doar în cadrul definiției funcției. Utilizăm această funcție nou definită prin apelarea ei cu noua valoare pe care dorim să o aiba parametrul în acest mod:
ru: Параметр функции действует как *переменная*, но только внутри функции, в которой мы его объявили. Теперь можно вызвать новую функцию со значением, которое необходимо ей передать::

source: We have been using functions with parameters since the beginning of the tutorial with ``turtle.forward()``, ``turtle.left()``, etc...
es_cl: Hemos estado usando funciones con parámetros desde el principio del tutorial con ``turtle.forward()``, ``turtle.left()``, etc...
ko: 따라하기 안내서 앞부분의 ``turtle.forward()``, ``turtle.left()``, 등을 사용할 때부터 우리는 이미 매개 변수와 함수를 같이 활용해보았어요.
ro: Am utilizat funcții cu parametri încă de la începutul cursului cu ``turtle.forward()``, ``turtle.left()`` etc.
ru: Мы пользовались функциями с параметрами еще в самом начале учебника используя ``turtle.forward()``, ``turtle.left()`` и т.д.

source: And we can put as many arguments (or parameters) as we want, separating them with commas and giving them different names::
es_cl: Y podemos poner tantos argumentos (o parámetros) como queramos, separándolos con comas y dándoles nombres distintos::
ko: 그리고 우리가 원하는 대로 수많은 인자(또는 매개 변수)를 놓을 수 있는데요, 이 값을 쉼표로 구분할 수 있고 다른 이름을 줄 수 있어요::
ro: Și putem pune oricâte argumente (sau parametri) dorim, separându-le cu virgule și dându-le nume diferite::
ru: И мы можем вставить столько аргументов (или параметров), сколько захотим, дав им разные имена и разделив запятыми::

source: A parameterized function for a variable size hexagon
es_cl: Una función parametrizada para un hexágono de tamaño variable
ko: 다양한 크기의 육각형을 그리는 매개 변수를 부여한 함수
ro: O funcție parametrizată pentru un hexagon de dimensiune variabilă
ru: Функция с параметрами для шестиугольника произвольного размера

source: Exercise
es_cl: Ejercicio
ko: 연습
ro: Exercițiu
ru: Упражнение

source: Write a function that allows you to draw hexagons of any size you want, each time you call the function.
es_cl: Escriba una función que permita dibujar hexágonos de cualquier tamaño que quiera, cada vez que llama a la función.
ko: 함수를 호출할 때마다 원하는 크기로 육각형을 그릴 수 있는 함수를 작성해보세요.
ro: Scrie o funcție care îți permite să desenezi hexagoane de orice dimensiune dorești, la fiecare apelare.
ru: Напиши функцию для рисования шестиугольника, которая позволяет выбирать его размер при вызове.

source: Solution
es_cl: Solución
ko: 해결책
ro: Soluție
ru: Решение

source: A function of several parameters
es_cl: Una función con varios parámetros
ko: 몇가지 매개 변수가 들어간 함수
ro: O funcție cu mai mulți parametri
ru: Функция с несколькими параметрами

source: Write a function that will draw a shape of *any* number of sides (let's assume greater than two) of any side length. Get it to draw some different shapes.
es_cl: Escriba una función que dibuje una figura de *cualquier* número de lados (asumamos mayor a dos) de cualquier largo de sus lados. Hágala dibujar diferentes figuras.
ko: 어떤 변의 길이를 가진 *어떤* 변(2보단 커야겠죠?)의 갯수만큼 도형을 그리는 함수를 작성해보아요. 각기 다른 도형을 그려보세요.
ro: Scrie o funcție care va desena o formă cu *oricâte* laturi (să presupunem că mai mult de două), de orice lungime a laturii. Fă-o să deseneze diverse forme.
ru: Напиши функцию для рисования фигур с произвольным количеством (т. е. >2) сторон любой длины и проверь её в деле.

source: Here's an example of drawing shapes with this function:
es_cl: Acá hay un ejemplo de figuras dibujadas con esta función:
ko: 이 함수를 통해 도형을 그리는 예제를 보여드릴께요:
ro: Uite un exemplu de desenare a unor forme cu această funcție:
ru: Пример рисования фигур с помощью этой функции:

source: The sum of the external angles of any shape is always 360 degrees!
ko: 어떤 도형이든 외각의 합은 360도가 돼요!
ro: Suma unghiurilor externe a oricărei forme este întotdeauna 360 de grade!
ru: Сумма внешних углов любой фигуры всегда равна 360 градусов!

source: Bonus
ko: 덤
ro: Supliment
ru: Дополнительно

source: It might sound crazy, but it's perfectly possible to pass a *function* as a parameter to another function! Python regards functions as perfectly normal 'things', the same as variables, numbers and strings.
es_cl: Puede sonar un poco loco, pero es perfectamente posible pasar como parámetro a una *función* otra función! Python considera a las funciones como perfectamente 'cosas' normales, lo mismo para variables, números y strings.
ko: 미친 소릴지도 모르겠는데 *함수*를 다른 함수에 매개 변수로 완벽하게 전달할 수 있어요! 파이썬에서는 함수를 변수, 숫자, 문자열 같은 완벽한 보통의 '실체'로 취급해요.
ro: Ar putea suna aiurea, dar este perfect posibil să transmiți o *funcție* ca parametru altei funcții! Python tratează funcțiile ca pe 'lucruri' perfect normale, la fel ca variabilele, numerele și șirurile de caractere.
ru: Это может звучать немного безумно, но вполне возможно передать *функции* в качестве параметра другую функцию — Python обращается с ними так же, как и с переменными, числами и строками.

source: For instance, you could create a shape drawing function which turned one way or another depending on which turtle function you passed to it - ``turtle.left`` or ``turtle.right``.
es_cl: Por ejemplo, puede dibujar una función que dibuje figuras que gire en un sentido o en otro dependiendo de que función de tortuga se le entregue - ``turtle.left`` o ``turtle.rught``.
ko: 예를 들자면, 한 방향으로 돌거나 여러분이 전달한 ``turtle.left`` 또는 ``turtle.right`` 거북이 함수에 따라 돈 방향에 따라 도형 그리기 함수를 만들 수 있죠.
ro: De exemplu, ai putea creea o funcție de desenare a funei forme care se întoarce într-o direcție sau alta în funcție de ce funcție îi transmiți - ``turtle.left`` sau ``turtle.right``.

source: See if you can implement this!
es_cl: Vea si puede implementar esto!
ko: 이걸 구현할 수 있는지 보세요!
ro: Vezi dacă poți implementa asta!
ru: Попоробуй, сможешь ли ты это сделать!

source: Passing a function (e.g ``turtle.left``) is different than *calling* it, which would instead be written ``turtle.left(45)``.
es_cl: Pasar una función (por ejemplo ``turtle.left``) es diferente a *llamarla*, que se escribiría ``turtle.left(45)``.
ko: 함수(예: ``turtle.left``) 전달은 ``turtle.left(45)``와 같은 식으로 작성하여 *호출* 하는 거와는 달라요.
ro: Transmiterea unei funcții (de ex. ``turtle.left``) este diferită de *apelarea* acesteia, care s-ar scrie ``turtle.left(45)``.
