Repository: OpenTechSchool/python-beginners
Catalog: source/locale/*/LC_MESSAGES/functions.po
Languages: es_cl, ro, ru

source: User-defined functions
es_cl: Funciones definidas por el usurario
ro: Funcții definite de utilizator
ru: Функции, определяемые пользователем

source: Introduction
es_cl: Introducción
ro: Introducere
ru: Введение

source: Programmers can deal with some pretty complex and abstract problems, but one sign of a good programmer is that they're lazy. They only like to deal with one thing at a time. So you need a way to break up problems into smaller, discrete pieces, which lets you focus on just the piece you want to.
es_cl: Programadores se pueden ver enfrentados a problemas muy complejos y abstractos, pero una de las señales de un buen programador es que son un poco flojos. Ellos sólo se enfrentan a una cosa a la vez. Entonces se necesita una forma para dividir los problemas en problemas más pequeños, piezas separadas, que permitan enfocarse solamente en la pieza que se quiere resolver.
ro: Programatorii pot întâlni probleme destul de complexe și abstracte, dar o caracteristică a unui bun programator este lenea. Ei doresc să aibă de-a face cu un singur lucru odată . Așa că ai nevoie să spargi problemele în bucăți mai mici, separate, care să îți permită să te concentrezi doar pe cea pe care dorești.

source: Functions are one way to do this abstraction in Python. Let's take ``turtle.reset()`` for example. ``reset`` is a function we call on our ``turtle``, and it is actually an abstraction for a number of steps, namely:
es_cl: Funciones son una forma de realizar esta abstracción en Python. Tomemos por ejemplo ``turtle.reset()``. ``reset`` es una función que llamamos en nuestra ``turtle``, y que es de hacho una abstracción para un número de pasos, es decir:
ro: Funcțiile sunt un mod de a face această abstractizare în Python. Hai să luăm ca exemplu ``turtle.reset()``. ``reset`` este o funcție pe care o apelăm pe ``turtle`` și este de fapt o abstractizare a unui număr de pași, adică:
ru: Функции -- один из способов в Python выразить эту абстракцию. В качестве примера рассмотрим ``turtle.reset()``. ``reset`` -- это функция, которая вызывает нашу черепашку (``turtle``) для выполнения некоторых действий, а именно:

source: Erase the drawing board.
es_cl: Borrar la superficie de dibujo.
ro: Șterge tabla.
ru: Очищение доски для рисования.

source: Set the width and color back to default.
es_cl: Establecer el ancho de línea y el color de vuelta a los valores por defecto.
ro: Setează lățimea și culoarea la valorile implicite.
ru: Возвращение ширины и цвета в исходное состояние.

source: Move the turtle back to its initial position.
es_cl: Mover la tortuga de vuelta a su posición inicial.
ro: Mută țestoasa înapoi la poziția inițială.
ru: Возвращение черепашки в исходное положение

source: But because all the code is contained in the function, we don't have to worry about these details. We can simply *call* this function, and know it will do what it says for us.
es_cl: Pero, dado que todo el código se encuentra contenido en la función, no debemos preocuparnos acerca de estos detalles. Podemos simplemente *llamar* esta función y sabemos que hará lo que dice que hace por nosotros.
ro: Dar pentru că tot codul este inclus în funcție, nu trebuie să ne facem griji pentru aceste detalii. Putem pur și simplu să *apelăm* această funcție și vom ști că va face ceea ce spune.
ru: Но так как весь код заключён в функцию, нам не нужно беспокоиться о деталях. Мы просто *вызываем* её.

source: So - how to write your own?
es_cl: Entonces - ¿cómo escribimos nuestras propias funciones?
ro: Deci - cum să îți scrii propriile funcții?

source: A function can be defined with the ``def`` keyword in Python::
es_cl: Una función puede ser definida con la palabra clave ``def`` en Python::
ro: O funcție poate fi definită în Python folosind cuvântul cheie ``def``::
ru: Функции в Python могут быть определены ключевым словом ``def``::

source: This function we defined is called ``line_without_moving`` and it is an abstraction for two turtle steps - a move forward and a move backward.
es_cl: La función que definimos se llama ``line_without_moving`` (línea sin moverse) y es una abstracción para dos pasos de la tortuga - un movimiento hacia adelante y otro hacia atrás.
ro: Funcția pe care am definit-o se numește ``line_without_moving`` și este o abstractizare a doi pași ai țestoasei - o deplasare înainte și o deplasare înapoi.
ru: Определённая нами функция называется ``line_without_moving`` и она является абстракцией для двух шагов - движения вперёд и движения назад.

source: To use it (or as it is usually called, "to call it"), write its name followed by parentheses::
es_cl: Para usarla (o como se suele decir usualmente, "para llamarla"), escriba su nombre seguido de paréntesis::
ro: Pentru a o utiliza (sau așa cum se spune de obicei, pentru a o *apela*), scrie numele ei urmat de paranteze::
ru: Чтобы использовать её (или, как обычно говорят "вызвать её"), напиши её имя и круглые скобки сразу за ним:

source: We could write more functions to remove some of the repetition::
es_cl: Podemos escribir más funciones para eliminar algo de la repetición::
ro: Am putea să scriem mai multe funcții pentru a elimina repetițiile::
ru: Мы можем написать больше функций, чтобы избавиться от некоторых повторений::

source: Python uses *indenting with whitespace* to identify blocks of code that belong together. In Python a block (like the function definitions shown above) is introduced with a colon at the end of the line and subsequent commands are indented --- usually 4 spaces further in. The block ends with the first line that isn't indented.
es_cl: Python utiliza *indentación con espacios blancos* para identificar bloques de código. En Python un bloque (como la definición de la función definida arriba) se introduce con dos puntos al final de la línea y los comandos que lo siguen estan indentados --- usualmente se utilizan 4 espacios. El bloque termina con la primera línea que no esté indentada.
ro: Python utilizează *indentarea cu spații albe* pentru a identifica blocuri de cod care au legătură. În Python un bloc (cum sunt definițiile funcțiilor de mai sus) este introdus cu un caracter două puncte la sfârșitul unei linii și liniile următoare sunt indentate -- în mod uzual cu 4 spații.
ru: В Python используются *отступы из пробелов/табуляций* для идентификации блоков кода, которые связаны друг с другом. Блок в Python'е (как показанное выше определение функции) должен иметь двоеточие в конце строки, а последующие команды -- отступы (обычно, размером в 4 пробела). Блок заканчивается первой линией без отступа в начале строки.

source: This is different to many other programming languages, which use special characters (like curly braces ``{}``) to group blocks of code together.
es_cl: Esto es distinto a otros lenguajes de programación, que utilizan caracteres especiales (como las llaves ``{}``) para agrupar los bloques de código.
ro: Asta este diferit față de multe alte limbaje de programare, care utilizează paranteze (cum ar fi acoladele ``{}``) pentru a grupa blocuri de cod.
ru: Это отличается от многих других языков программирования, в которых для определения связанных блоков кода используются специальные символы (такие как фигурные скобки ``{}``)

source: Never use tab characters to indent your blocks, only spaces. You can -- and should -- configure your editor to put 4 spaces when you press the tab key. The problem with using tab characters is that other python programmers use spaces, and if both are used in the same file python will read it wrong (in the best place, it will complain, and in the worst case, weird, hard to debug bugs will happen).
es_cl: Nunca use caracteres de tabulación para sangrar sus bloques de código. Puede -- y debería -- configurar su editor para que coloque 4 espacios cuando presione la tecla tab. El problema con los caracteres de tabulación es que otros programadores usan espacios, y si ambos se utilizan en el mismo archivo de python se leerá en forma errónea (en el mejor caso, aparecerá una advertencia, en el peor, sucederán errores raros y difíciles de encontrar)
ro: Nu utiliza niciodată caractere tab pentru indenta blocurile tale, ci doar spații. Poți -- și ar trebui să o faci -- să îți configurezi editorul tău să adauge 4 spații cănd apeși tasta tab. Problema cu utilizarea caracterelor tab este că alți programatori Python folosesc spații și dacă sunt folosite în combinație în același fișier atunci Python le va citi greșit (în cel mai bun caz, te va anunța, iar în cel mai rău caz vor apărea erori greu de identificat).
ru: Никогда не используй табуляцию для выделения своих блоков, только пробелы. Ты можешь -- и должен -- настроить свой редактор, чтобы тот вставлял 4 пробела, когда ты нажимаешь клавишу Tab

source: A function for a square
es_cl: Una función para un cuadrado
ro: O funcție pentru un pătrat
ru: Функция для рисования квадрата

source: Exercise
es_cl: Ejercicio
ro: Exercițiu
ru: Упражнение

source: Write a function that draws a square. Could you use this function to improve the tilted squares program? If you change the program to use a function, is it easier to experiment with?
es_cl: Escriba una función que dibuje un cuadrado. Puede usar esta fiunción para mejorar el programa de los cuadrados inclinados? Si usted cambia el programa para usar la función, es más fácil experimentar con él?
ro: Scrie o funție care desenează un pătrat. Poți utiliza această funcție pentru a îmbunătăți programul cu pătrate înclinate? Dacă schimbi programul pentru a folosi o funcție, este mai ușor să experimtentezi?
ru: Напиши функцию для рисования квадрата. Можешь ли ты использовать эту функцию для улучшения программы для рисования повёрнутых квадратов? Если ты внедришь в программу функции, с ней будет легче экспериментировать?

source: Solution
es_cl: Solución
ro: Soluție
ru: Решение

source: A function for a hexagon
es_cl: Una función para un Hexágono
ro: O funcție pentru un hexagon
ru: Функция для рисования шестиугольника

source: Write a function that draws a hexagon.
es_cl: Escriba una función que dibuje un hexágono.
ro: Scrie o funcție care desenează un hexagon.
ru: Напишите функцию для рисования шестиугольника

source: Now combine that function into a honeycomb. Just make it with a single layer like this:
es_cl: Ahora utilizando esa función construya una colmena. Hágala solamente con una capa, como la que sigue:
ro: Acum combină funcția aceasta într-un fagure. Creează un singur strat așa:
ru: Теперь комбинируй эту функцию, чтобы нарисовать соты. Просто сделай однослойную картинку, как эта:

source: Give it a good go!
es_cl: Usted puede hacerlo!
ro: Încearcă!

source: Make sure your hexagon function returns your turtle to exactly the same position and angle it was before it was asked to draw the hexagon. This makes it easier to reason about.
es_cl: Asegúrese que su función de hexágono devuelve a la tortuga exactamente a su posición y ángulo iniciales antes de que dibuje un nuevo hexágono. Esto hace más fácil el razonar como continuar.
ro: Asigură-te că funcția ta hexagon întoarce țestoasa exact în aceeași poziție și unghi cum era înainte de a desena hexagonul. Este mai ușor să te gândești în acest fel.

source: You could also put the ``turtle.forward(100); turtle.right(60)`` portion in the function, but you better not call it ``hexagon`` in that case. That's misleading because it actually draws a hexagon and then advances to a position where another hexagon would make sense in order to draw a honeycomb. If you ever wanted to reuse your hexagon function outside of honeycombs, that would be confusing.
es_cl: Usted podría poner la parte ``turtle.forward(100); turtle.right(60)```dentro de la función que dibuja el hexágono, pero en ese caso es mejor no llamarla ``hexagon`` Esto es un poco engañoso, ya que de hecho dibuja un hexágono y avanza a la posición donde se debe dibujar otro hexágono para dibujar la colmena. Sin embargo, si desea utilizar nuevamente la función para dibujar un hexágono en otro contexto que no sea dibujar colmenas, este funcionamiento sería confuso.
ro: Poți să pui partea cu``turtle.forward(100); turtle.right(60)`` direct în funcție, dar în acest caz ar fi mai bine să nu o denumești ``hexagon``. Asta ar fi derutant pentru că de fapt desenează un hexagon și pe urmă avansează într-o poziție în care un alt hexagon ar avea sens doar în cazul unui fagure. Dacă ai avea nevoie să reutilizezi funcția la altceva decât faguri, asta ar fi neașteptat.
