Repository: OpenTechSchool/python-beginners
Catalog: source/locale/*/LC_MESSAGES/getting_started.po
Languages: es_cl, ko, ro, ru

source: Getting started
es_cl: Primeros Pasos
ko: 시작하기
ro: Să începem
ru: Приступая к работе

source: What you'll need
es_cl: Lo que necesitarás
ko: 필요한 것은
ro: Ce ai nevoie
ru: Что тебе потребуется

source: A Python!
es_cl: Un Python!
ko: 파이썬이죠~!
ro: Un Python!
ru: Python!

source: If you haven't yet got python, the latest official installation packages can be found here:
es_cl: Si aún no tienes python, los últimos paquetes oficiales para su instalación puedes encontrarlos aqui:
ko: 파이썬을 아직 못 구했다면, 최신 공식 설치 꾸러미를 다음에서 찾을 수 있어요:
ro: Daca încă nu ai Python, cele mai recente pachete de instalare sunt disponibile aici:
ru: Если у тебя ещё нет Python'а, ты можешь найти последние официальные установочные файлы здесь:

source: Python 3 is preferable, being the newest version out!
es_cl: Es preferible el uso de Python 3, ya que es la versión más nueva que ha salido!
ko: 출시된 새 버전으로는 파이썬 3이 적당할 수 있어요!
ro: Este de preferat Python 3, aceasta fiind cea mai nouă versiune!
ru: Будучи последним, Python 3 предпочтительнее!

source: On Windows, you'll want to add :program:`Python` to your path, so it can be found by other programs. To do this, navigate to your installation directory (:file:`C:\\Python33\\`), open the :file:`Tools`, then :file:`Scripts` folders, and run the :file:`win_add2path.py` file by double clicking on it.
es_cl: En Windows, usted querrá añadir :program:`Python` a su path, así podrá ser encontrado por otros programas. Para hacer esto, vaya al directorio de instalación de Python (:file: `C:\\Python33\\`), abra la carpeta :file: `Tools` y luego :file: `Scripts`, y ejecute el archivo :file: `win_add2path.py` haciendo doble click en él.
ko: 윈도우즈에서는, :program:`파이썬`을 경로에 추가하여 다른 프로그램이 찾게 할 수 있어요. 이렇게 하려면 설치 디렉터리를 찾아서(:file:`C:\\Python33\\`), :file:`Tools` 를 열고, :file: `Scripts`를 연 다음, :file:`win_add2path.py` 파일을 두 번 눌러 실행하세요.
ro: Pe platforme Windows, poți să adaugi :program:`Python` la calea ta, astfel încăt să poată fi găsit de alte programe. Pentru a face asta, mergi în directorul tău de instalare (:file:`C:\\Python33\\`), deschide directorul :file:`Tools`, pe urmă directorul :file:`Scripts` și execută fișierul :file:`win_add2path.py` cu dublu clic.
ru: На Windows можно добавить :program:`Python` в переменную "path", чтобы её было легче найти. Для этого нужно перейти в каталог с установленным Python'ом (например, :file:`C:\\Python33\\`), открыть директорию :file:`Tools`, потом — :file:`Scripts` и запустить двойным кликом файл :file:`win_add2path.py`.

source: And a Code Editor
es_cl: Y un Editor de Código
ko: 그리고 코드 편집기요
ro: Și un editor
ru: И редактор кода

source: A code editor helps with reading and writing programming code. There are many around, and it is one of the most personal choices a programmer can make - Like a tennis-player choosing their racket, or a chef choosing their favourite knife. To start off with, you'll just want a basic, easy-to-use one that doesn't get in your way, but is still effective at writing python code. Here are some suggestions for those:
es_cl: Un editor de código ayuda a leer y escribir códigos de programas. Existen muchos, y es una de las elecciones más personales que un programador puede hacer - Como un jugador de tenis escogiendo su raqueta, o un chef escogiendo su cuchillo favorito. Para empezar, necesitaras uno básico y fácil de usar, que no se interponga en tu camino, pero que, de la misma forma sea efectivo al escribir código Python. Acá hay algunas sugerencias para escoger:
ko: 코드 편집기는 프로그래밍 코드를 읽고 작성하는데 도움을 줘요. 여러가지가 있는데 테니스 선수가 라켓을 고르거나 주방장이 맘에 드는 식칼을 고르는 것처럼 프로그래머가 고를 수 있는 개개인이 가장 많이 선택하는 것이기도 해요. 시작하려면, 기본적이고, 써보지는 못했지만 사용하기 쉬워야 하지만 파이썬 코드 작성에 효율적이어야죠. 몇가지 소개좀 해볼께요:
ro: Un editor te ajută să citești și să scrii cod. Există foarte multe, și acesta este una dintre cele mai personale alegeri pe care le poate face un programator - ca un jucător de tenis care își alege racheta, sau ca un bucătar șef care își alege cuțitul preferat. Pentru început, o să vrei doar un editor simplu, ușor de utilizat și care nu te încurcă, dar este totuși eficient la scrierea de cod Python. Iată câteva sugestii:
ru: Хороший редактор кода помогает читать и писать программы. Их много, а каждый программист выбирает подходящий для себя так же, как теннисист выбирает ракетку, а шеф-повар — нож. Начинающим больше подойдут несложные, незапутанные, но помогающие в работе, редакторы, например:

source: `Sublime Text`_: A great all around editor that's easy to use. It's Ctl+B shortcut lets you run the python file you're working on straight away. Runs on Windows, Mac and Linux.
es_cl: `Sublime Text`_: Un gran editor que es fácil de usar. Su atajo de teclado Ctrl+B permite correr el archivo python en que estás trabajando directamente. Corre en Windows, Mac y Linux.
ko: `서브라임 텍스트`_: 편집기 중에서도 사용하기 쉬운 완벽한 편집기예요. Ctrl+B 단축키로 작업중인 파이썬 파일을 바로 실행하게 해줘요. 윈도우즈, 맥, 리눅스에서 동작해요.
ro: `Sublime Text`_: Un excelent editor care este simplu de utilizat. Scurtătura acestuia Ctrl+B îți permite să execuți imediat fișierul Python la care lucrezi. Rulează pe Windows, Mac și Linux.
ru: `Sublime Text`_: простой, но проприетарный редактор, поддерживающий Windows, Mac и GNU/Linux. Сочетание клавиш Ctl+B запускает открытый файл.

source: `Geany`_: A simple editor that doesn't aim to be too complicated. Available on Windows and Linux (you can probably find it in your package manager).
es_cl: `Geany`_: Un editor simple que no pretende ser demasiado complicado. Disponible en Windows y Linux (probablemente lo encontrarás en tu gestor de paquetes)
ko: `Geany`_: 복잡하지 않음을 목표로한 단순한 편집기예요. 윈도우즈와 리눅스에서 사용할 수 있어요(꾸러미 관리자에서 찾을 수 있을지도 몰라요).
ro: `Geany`_: Un editor simplu care nu își propune să fie extrem de complicat. Disponibil pe Windows și Linux (probabil îl poți găsi în programul tău de gestiune a pachetelor).
ru: `Geany`_: простой в обращении и не перегруженный функциями редактор, работающий на Windows и GNU/Linux.

source: `TextMate`_: One of the most famous code editors for Mac, it used to be a paid product but has since been open-sourced.
es_cl: `TextMate`_: Uno de los más famosos editores de código para Mac, solía ser un producto pagado pero ahora es de código abierto.
ko: `텍스트메이트`_: 맥용 코드 데이터로는 가장 잘 알려져 있는데요, 유료 제품이지만 소스는 이미 공개되어 있어요.
ro: `TextMate`_: Unul dintre cele mai faimoase editoare pentru Mac, a fost un produs comercial dar între timp a devenit open-source.
ru: `TextMate`_: один из самых известных редакторов кода для Mac'ов, изначально бывший коммерческим продуктом, но позже ставший свободным и бесплатным.

source: `Gedit`_ and `Kate`_: if you run Linux using Gnome or KDE respectively, you might already have one of these two installed!
es_cl: `Gedit`_ and `Kate`_: Si usas Linux ya sea con Gnome o KDE respectivamente, es posible que ya tengas uno de estos dos instalado!
ko: `Gedit`_ 와 `Kate`_: 그놈이나 KDE 둘 중 하나를 사용하면, 이미 둘 중 하나는 설치되어 있을지도 몰라요!
ro: `Gedit`_ and `Kate`_: dacă dorești să folosești Linux cu Gnome și respectiv KDE, probabil ai deja unul dintre acestea instalat!
ru: `Gedit`_ и `Kate`_: если ты используешь GNU/Linux с Gnome или KDE соответственно, то один из них должен быть предустановлен!

source: `Komodo Edit`_: a sleak, free editor for Mac, Windows and Linux, based on the more powerful Komodo IDE.
es_cl: `Komodo Edit`_: un pulcro, editor libre para Mac, Windows y Linux, basado en el más poderoso Komodo IDE.
ko: `Komodo Edit`_: 좀 강력한 코모도 IDE를 기반으로 하는 뽀대나는 공짜 편집기인데요. 맥용, 윈도우용, 리눅스용이 있어요.
ro: `Komodo Edit`_: un editor strălucit, gratuit pentru Mac, Windows și Linux, bazat pe mai puternicul Komodo IDE.
ru: `Komodo Edit`_: неплохой свободный редактор под Mac, Windows и GNU/Linux, основанный на более мощной Komodo IDE.

source: If you'd like our recommendation, try out Sublime Text first.
es_cl: Si usted quiere nuestra recomendación, intente con Sublime Text primero.
ko: 추천해주는게 좋다면, 먼저 서브라임 텍스트를 써보세요.
ro: Dacă dorești recomandarea noastră, încearcă prima dată Sublime Text.
ru: Если ты хочешь последовать нашим рекомендациям, для начала попробуй Sublime Text.

source: Wordpad, TextEdit, Notepad, and Word are **not** suitable text editors.
es_cl: Wordpad, TextEdit, Notepad y Word **no** son editores de texto adecuados.
ko: 워드패드, 텍스트에디트, 노드패드, 워드는 텍스트 편집기로 **적당하지 않아요**.
ro: Wordpad, TextEdit, Notepad, și Word **nu** sunt editoare de text potrivite.
ru: Wordpad, TextEdit, Notepad и Word -- неподходящие текстовые редакторы.

source: What is Python, exactly?
es_cl: ¿Qué es Python, exactamente?
ko: 그래서 파이썬이 정확하게 뭐라는건가요?
ro: Ce este Python de fapt?
ru: Всё же, что такое Python?

source: Ok, so python is this thing called a **programming language**. It takes text that you've written (usually referred to as **code**), turns it into instructions for your computer, and runs those instructions. We'll be learning how to write code to do cool and useful stuff. No longer will you be bound to use others' programs to do things with your computer!
es_cl: Ok, python es esta cosa llamada un **lenguaje de programación**. Toma texto que usted haya escrito (usualmente llamado **código**), lo transforma en instrucciones para su computadora, y ejecuta esas instrucciones. Aprenderemos cómo escribir código para hacer cosas útiles y geniales. Ya no estará obligado a usar programas de los demás para hacer cosas con su computadora!
ko: 네, 그래서 파이썬은 **프로그래밍 언어**라고 하는거예요. 여러분이 쓴 텍스트(보통 **코드**라고 해요)를 받아서요, 컴퓨터에 명령으로 바꿔서 전달하고, 이 명령을 실행해줍니다. 앞으로 쌈박하고 쓸모 있는 동작을하는 코드를 어떻게 작성할지 배울거예요. 컴퓨터로 무언가를 하는데 다른 프로그램을 써야 할 일은 앞으로 없을거예요!
ro: Bine, Python este ceva numit un **limbaj de programare**. Preia ceea ce scrii (în mod normal denumit **cod**), îl transformă în instrucțiuni pentru calculatorul tău și le execută. O să învățăm cum să scriem cod pentru a face lucruri interesante și utile. Nu vei mai fi nevoit să folosești programele altora pentru a face lucruri cu calculatorul tău!
ru: Python - это вещь, называемая **языком программирования**. Она принимает текст (обычно называемый **кодом**), который ты написал, переводит его в инструкции для компьютера, которые затем исполняет. Мы будем учиться писать код, чтобы делать клёвые и полезные вещи. Отныне вы не обязаны использовать чужие программы, чтобы выполнять работу на компьютере!

source: Practically, Python is just another program on your computer. The first thing to learn is how to use and interact with it. There are in fact many ways to do this; the first one to learn is to interact with python's interpreter, using your **operating system's** (OS) console.
es_cl: Prácticamente, Python es sólo otro progama en su computadora. Lo primero que hay que aprender es cómo usarlo e interactuar con él. Hay, de hecho, muchas formas de hacerlo; lo primero que se debe aprender es interactuar con el intérprete de python, usando la consola de su **sistema operativo** (SO)
ko: 실제로, 파이썬은 컴퓨터의 다른 프로그램일 뿐이예요. 먼저 배우게 될건 어떻게 쓰고 다루느냐예요. 사실 다루는덴 여러가지 방법이 있죠. 먼저 배울건 **운영 체제**(OS)의 콘솔을 활용해서 파이선 인터프리터와 대화 하는 방법이예요.
ro: Practic, Python este doar un alt program în calculatorul tău. Primul lucru pe care trebuie să îl înveți este cum să interacționezi cu el. Există multe metode ca să faci asta; prima este să interacționezi cu interpretorul Python, utilizând consola **sistemului de operare** (OS, prescurtare de la Operating System).
ru: В действительности, Python -- всего лишь ещё одна программа на твоём компьютере. Для начала нужно узнать, как использовать и взаимодействовать с ним. Существует много способов научиться этому, первый из которых -- работать и интерпретатором Python, используя консоль **операционной системы** (ОС).

source: A **console** (or 'terminal', or 'command prompt') is a *textual* way to interact with your OS, just as the 'desktop', in conjuction with your mouse, is the *graphical* way to interact your system.
es_cl: Una **consola** (o 'terminal', o 'línea de comandos') es una forma *textual* de interactuar con su SO, así como el 'escritorio', en conjunto con su mouse, es la forma *gráfica* de interactuar con el sistema.
ko: **콘솔** (또는 '터미널','명령 프롬프트')은 시스템에서 마우스와 결합한 '데스크톱'이 OS와 의사소통을 하는 방식이 *그래픽* 방식인것과 같이, *글자* 방식으로 OS와 의사소통하는 방식이예요.
ro: O **consolă** (sau 'terminal', sau 'linie de comandă') este o formă de a interacționa cu sistemul tău de operare în mod *text*, așa cum 'desktop'-ul, în combinație cu mouse-ul tău, este metoda *grafică* de interacțiune cu sistemul tău.
ru: **Консоль** ("терминал", "командная строка") -- это текстовый (в отличие от так называемых "окружений рабочего стола" (Desktop Environment, DE), работающих в связке с мышью) интерфейс для работы с ОС.

source: Opening a console on Mac OS X
es_cl: Abriendo una consola en Mac OS X
ko: 맥 OS X에서 콘솔을 열어보아요
ro: Deschiderea unei console în Mac OS X
ru: Открываем консоль в Mac OS X

source: OS X's standard console is a program called :program:`Terminal`. Open Terminal by navigating to Applications, then Utilities, then double-click the :program:`Terminal` program. You can also easily search for it in the system search tool in the top right.
es_cl: La consola estándar de OS X es un programa llamado :program:`Terminal`. Abra Terminal navegando a Aplicaciones, luego Utilidades, luego doble click en el programa :program:`Terminal`. Usted puede también buscarlo fácilmente con la herramienta de búsqueda de sistema ubicada en la parte superior derecha.
ko: OS X의 표준 콘솔은 :program:'터미널'이라고 해요. 응용 프로그램, 유틸리티를 들어가서 :program:`터미널`프로그램을 두 번 눌러서 터미널을 여세요. 우측 상단의 시스템 검색 도구를 사용하면 쉽게 찾을 수 있어요.
ro: Consola standard a lui OS X este un program numit :program:`Terminal`. Deschide Terminal mergănd la Applications, apoi Utilities, apoi dublu clic pe programul :program:`Terminal`. Poți de asemenea să cauți ușor folosind unealta de căutare din dreapta-sus.
ru: Стандартная консоль OS X зовётся :program:`Терминалом`, который можно найти с помощью поиска (правый верхний угол) по системе или в разделе Приложения -> Утилиты .

source: The command line Terminal is a tool for interacting with your computer. A window will open with a command line prompt message, something like this::
es_cl: El Terminal es una herramienta de línea de comandos para interactuar con su ordenador. Una ventana se abrirá con un mensaje en la línea de comandos, algo como lo que sigue::
ko: 명령행 터미널은 컴퓨터와 대화하는 도구예요. 다음처럼 명령행 프롬프트 메시지를 띄운 창이 뜰거예요::
ro: Linia de comandă Terminal este un instrument pentru interacțiunea cu calculatorul tău. Se va deschide o fereastră cu un mesaj, cum ar fi:
ru: Командная строка Terminal — это инструмент для "общения" с компьютером. Открывшееся окно должно содержать сообщение-подсказку, что-то вроде этого::

source: Opening a console on Linux
es_cl: Abriendo una consola en Linux
ko: 리눅스 콘솔을 열어보아요
ro: Deschiderea unei console în Linux
ru: Открываем консоль в GNU/Linux

source: Different linux distributions (e.g Ubuntu, Fedora, Mint) may have different console programs, usually referred to as a terminal. The exact terminal you start up, and how, can depend on your distribution. On Ubuntu, you will likely want to open :program:`Gnome Terminal`. It should present a prompt like this::
es_cl: Diferentes distribuciones de linus (como Ubuntu, Fedora, Mint) pueden tener diferentes programas de consola, usualmente llamados terminal. El terminal exacto que se inicia y como puede depender de su distribución. En Ubuntu, es probable que quiera abrir :program:`Gnome Terminal`. Deberia aparecer una línea de comandos como la que sigue::
ko: 제각각의 리눅스 배포판(예: 우분투, 페도라, 민트)은 제각각의 콘솔 프로그램이 있는데요, 보통 터미널이라고 해요. 정확하게 시작하는 터미널이랑 방식은 배포판에 따라 달라요. 우분투에서는 :program:`그놈 터미널`같은걸 열려고 하겠죠. 다음처럼 생긴 프롬프트가 보일거예요::
ro: Diverse distribuții Linux (ex. Ubuntu, Fedora, Mint) pot avea diverse programe de consolă, numite de obicei terminale. Cel pe care îl ai disponbil și modul în care îl lansezi depinde de distribuție. Pe Ubuntu probabil că vei vrea să deschizi :program:`Gnome Terminal`. Ar trebui să prezinte un prompt de genul:
ru: В дистрибутивах GNU/Linux (Ubuntu, Fedora, Mint и т.д.) обычно уже установлены разные программы-консоли, обычно называемые терминалами. То, какой терминал установлен, зависит от используемого дистрибутива. Например, в Ubuntu это :program:`Gnome Terminal`. После запуска появляется приглашение вроде этого::

source: Opening a console on Windows
es_cl: Abriendo una consola en Windows
ko: 윈도우즈에서 콘솔을 열어보아요
ro: Deschiderea unei console în Windows
ru: Открываем консоль в Windows

source: Window's console is called the Command Prompt, named :program:`cmd`. An easy way to get to it is by using the key combination :kbd:`Windows+R` (:kbd:`Windows` meaning the windows logo button), which should open a :guilabel:`Run` dialog. Then type :program:`cmd` and hit :kbd:`Enter` or click :guilabel:`Ok`. You can also search for it from the start menu. It should look like::
ko: 윈도우 콘솔 이름은 :program:`cmd`라고 하고 명령 프롬프트라고 해요. 명령 프롬프트를 불러오는 쉬운 방법은 그냥 단축키 :kbd:`Windows+R`를 써서 (:kbd:`Windows`윈도우 로고 단추를 의미해요), :guilabel:`실행` 대화 상자를 여는거예요. 그 다음 :program:`cmd` 를 입력하고 :kbd:`Enter`키를 치거나 :guilabel:`확인`을 누르세요. 시작 메뉴에서 찾아볼 수도 있어요. 다음과 같은게 떠야해요::
ro: Consola Windows este Command Prompt, numită :program:`cmd`. O variantă simplă pentru a o obține este să utilizezi combinația :kbd:`Windows+R` (unde :kbd:`Windows` este tasta cu sigla Windows), care ar trebui să deschidă un dialog :guilabel:`Run`. Scrie apoi :program:`cmd` și apasă :kbd:`Enter` sau dă clic pe :guilabel:`Ok`. Poți de asemenea să o cauți în meniul de start. Ar trebui sa arate cam așa:
ru: В WIndows консоль называется командной строкой (:program:`cmd`). Самый простой способ запустить её --- нажать :kbd:`Windows+R` (:kbd:`Windows` --- это клавиша с соответствующим логотипом), в открывшемся окне ввести :program:`cmd` и нажать Enter (или кликнуть по кнопке :guilabel:`Ok`); также можно найти её в меню :guilabel:`Пуск`. Выглядеть командная строка должна примерно так::

source: Window's Command Prompt is not quite as powerful as its counterparts on Linux and OS X, so you might like to start the Python Interpreter (see just below) directly, or using the IDLE program that Python comes with. You can find these in the Start menu.
es_cl: La línea de comandos de Windows no es tan poderosa como sus contrapartes en Linux y OS X, es por esto que es preferible empezar con el Intérprete de Python (mire abajo) directamente, o usar la IDLE que viene con Python. Usted puede encontrarlos en el menú de inicio.
ko: 윈도우 명령 프롬프트는 리눅스나 OS X에서와 같이 강력한건 아닌지라 파이썬 인터프리터를 (아래 처럼) 직접 시작하거나, 파이썬에 딸려오는 IDLE 프로그램을 활용하는게 좋을거예요. 시작 메뉴에서 찾을 수 있어요.
ro: Command Prompt-ul din Windows nu este la fel de puteric precum omologii lui din Linux și OS X, așa că ar fi posibil să dorești să apelezi Interpretorul Python (vezi mai jos) direct, sau utilizând programul IDLE cu care se livrează Python. Le poți găsi în meniul de Start.
ru: Командная строка Windows намного менее функциональна, чем её аналоги из GNU/Linux и OS X, потому лучше запускать интерпретатор Python'а (см. ниже) напрямую или с помощью программы IDLE, которая поставляется с Python'ом (найти её можно в меню "Пуск").

source: Using Python
es_cl: Usando Python
ko: 파이선 사용하기
ro: Utilizarea Python
ru: Использование Python

source: The python program that you have installed will by default act as something called an **interpreter**. An interpreter takes commands and runs them as you enter them - very handy for trying things out.
es_cl: El programa python que usted a instalado actuará por defecto como algo llamado **intérprete**. Un intérprete toma los comandos y los ejecuta a medida que se ingresan - muy útil para realizar pruebas.
ko: 설치한 파이선 프로그램은 기본적으로 **인터프리터**라고 하는 것처럼 동작할거예요. 인터프리터는 입력한대로 명령을 받아서 실행해요. 무언가를 해볼때 참 간편하죠.
ro: Programul Python pe care l-ai instalat se va comporta în mod automat ca ceva numit **interpretor**. Un interpretor preia comenzi și le execută pe măsură ce le introduci - foarte comod pentru a putea încerca lucruri.
ru: Python-программа, установленная по умолчанию, называется **интерпретатором**. Интепретатор принимает команды и выполняет их после ввода. Очень удобно для тестирования чего-либо.

source: Just type :program:`python` at your console, hit :kbd:`Enter`, and you should enter Python's Interpreter.
ko: 콘솔에서 :program:`python`를 입력하고 :kbd:`Enter`키를 치면, 파이선 인터프리터로 들어가게 돼요.
ro: Scrie pur și simplu :program:`python` în consolă, apasă :kbd:`Enter` și ar trebui să intri în Interpretorul Python.
ru: Чтобы запустить интерпретатор, просто введи :program:`python` и нажми Enter.

source: To find out which version of python you're running, use ``python -V`` to tell you.
es_cl: Para saber que versión de python está usando, escriba ``python -V``, en la consola.
ko: 실행하는 파이선 버전을 확인해보려면 ``python -V`` 명령을 사용하세요.
ro: Pentru a afla ce versiune de Python rulezi, folosește ``python -V``.
ru: Чтобы узнать, какая версия Python запущена, используй ``python -V``

source: Interacting With Python
es_cl: Interactuando con Python
ko: 파이선을 다루어보아요
ro: Interacțiunea cu Python
ru: Взаимодействие с Python'ом

source: After Python opens, it will show you some contextual information similar to this::
es_cl: Después que abra Python, se mostrará alguna información contextual similar a lo siguiente::
ko: 파이썬을 열면, 다음과 같이 상황 정보가 나타나요::
ro: După ce pornește, Python va tipări niște informații de conext, similar cu:
ru: Когда Python запустится, ты увидишь что-то вроде этого::

source: The prompt **>>>** on the last line indicates that you are now in an interactive Python interpeter session, also called the "Python shell". **This is different from the normal terminal command prompt!**
es_cl: El símbolo **>>>** en la última línea indica que usted se encuentra en la sesión del intérprete interactiva de Python, también llamada "Python shell". **Este es diferente del símbolo de sistema normal del terminal!**
ko: 마지막 줄의 **>>>** 프롬프트는 대화형 파이선 인터프리터 세션에 있다는걸 보여주는데 이걸 "파이썬 쉘" 이라고 해요. **보통 터미널 명령 프롬프트와는 달라요!**
ro: Prompt-ul **>>>** de pe ultima linie indică faptul că ești într-o sesiune Python interactivă, numită și "Python shell". **Aceasta este diferit de prompt-ul terminalului normal!**
ru: **>>>** в последней строке означает, что сейчас мы находимся в интерактивном интерпретаторе Python, также называемом "Оболочкой Python (Python shell)". **Это не то же самое, и что обычная командная строка!**

source: You can now enter some python code. Try::
es_cl: Ahora usted puede ingresar algún código de python. Intente::
ko: 몇가지 파이선 코드를 입력할 수 있어요. 해보세요::
ro: Poți acum să introduci cod Python. Încearcă:
ru: Теперь ты можешь ввести немного Python-кода. Попробуй::

source: Press :kbd:`Enter` and see what happens. After showing the results, Python will bring you back to the interactive prompt, where you could enter another command:
ko: :kbd:`Enter`키를 눌러 어떤 일이 일어나는지 보세요. 결과를 표시하고 나면 파이썬에서는 다른 명령을 입력할 수 있는 대화 프롬프트로 돌아갑니다.
ro: Apasă :kbd:`Enter` și vezi ce se întâmplă. Dupa ce îți afișează rezultatele, Python va reveni la prompt-ul interactiv, unde poți introduce o altă comandă:
ru: Нажми :kbd:`<Enter>` и посмотри, что произошло. После вывода результата Python вернёт тебя обратно в интерактивную оболочку, в которой мы можем ввести какую-нибудь другую команду:

source: An extremely useful command is ``help()``, which enters a help functionality to explore all the stuff python lets you do, right from the interpreter. Press :kbd:`q` to close the help window and return to the Python prompt.
ko: 상당히 쓸모있는 명령은 ``help()`` 인데요, 도움말 기능으로 들어가서 동작해보려는 파이선의 모든 요소를 탐색하고 결과를 인터프리터에 바로 뿌려줘요. :kbd:`q`를 입력하면 도움말 창을 닫고 파이썬 프롬프트로 돌아가요.
ro: O comandă extrem de utilă este ``help()``, care accesează o funcționalitate de documentare pentru explorarea tuturor lucrurilor pe care Python îți permite să le faci, direct din interpretor. Apasă :kbd:`q` pentru a închide fereastra de documentație și a reveni la prompt-ul Python.
ru: Очень полезна команда ``help()``, которая поможет тебе изучить досконально изучить Python, не выходя из интерпретатора. Нажми :kbd:`q`, чтобы закрыть окно со справкой и вернуться в командную строку Python.
