Repository: OpenTechSchool/python-beginners
Catalog: source/locale/*/LC_MESSAGES/getting_started.po
Languages: es_cl, ko, ro, ru

source: To leave the interactive shell, press :kbd:`Ctrl-Z` and then :kbd:`Enter` on Windows, or :kbd:`Ctrl-D` on OS X or Linux. Alternatively, you could also run the python command ``exit()``!
es_cl: Para abandonar la consola inetractiva, presione :kbd:`Ctrl-Z` y luego :kbd:`Enter` en Windows, o :kbd:`Ctrl-D` en OS X o Linux. Alternativamente, puede correr el comando de python ``exit()``!
ko: 대화형 쉘을 나가려면 :kbd:`Ctrl-Z`를 누르고, 윈도우에서는 :kbd:`Enter`, OS X나 리눅스에서는 :kbd:`Ctrl-D`를 누르세요. 대신 파이선 명령 ``exit()``를 실행할 수도 있어요!
ro: Pentru a ieși din shell-ul interactiv, apasă :kbd:`Ctrl-Z` și apoi :kbd:`Enter` în Windows, sau :kbd:`Ctrl-D` în OS X sau Linux. Alternativ, poți de asemenea să execuți comanda ``exit()``!
ru: Чтобы выйти из интерактивной оболочки, нажми :kbd:`Ctrl-Z` и затем :kbd:`Enter`, если используешь Windows, и :kbd:`Ctrl-D`, если используешь GNU/Linux или OS X. Этого же можно добиться вводом Python-команды ``exit()``.

source: Running Python files
es_cl: Ejecutando archivos Python
ko: 파이썬 파일 실행
ro: Executarea fișierelor Python
ru: Запуск файлов с Python-кодом

source: When you have a lot of python code to run, you will want to save it into a file so, for instance, you can modify small parts of it (fix a bug) and re-run it without having to repeatedly re-type the rest. Instead you can save your code to a file and pass a file name to the :program:`python` executable. It will execute that file instead of launching the interactive interpreter.
es_cl: Cuando usted tenga una gran cantidad de código python para ejecutar, querrá guardarlo en un archivo, entonces, por ejemplo, usted puede modificar pequeñas partes de él (corregir errores) y ejecutarlo nuevamente sin tener que re-escribir repetidamente el resto del código. Se puede entonces almacenar el código en un archivo y entregar el nombre del archivo al ejecutable :program:`python`. Este ejecutará el archivo en vez de lanzar el intérprete interactivo.
ko: 실행할 많은 파이선 코드가 있으면 파일로 저장할 수 있는데요, 가령 코드 일부를 고칠 수 있고요(버그 고치기), 나머지 부분을 다시 반복해서 입력하지 않아도 실행할 수 있어요. 대신 파일에 코드를 저장할 수 있고요, :program:`python`에서 실행할 수 있게 파일 이름을 전달할 수 있어요. 대화형 인터프리터를 실행하는 대신에 파일을 바로 실행해줘요.
ro: Când ai de executat mult cod Python vei dori să îl salvezi într-un fișier pentru ca, de exemplu, să poți modifica bucăți din el (să rezolvi o eroare) și să îl execuți din nou fără a fi nevoie să introduci din nou restul codului. Alternativ poți salva codul într-un fișier și să îi transmiți numele acestuia executabilului :program:`python`. Acesta va executa fișierul în loc să lanseze interpretorul interactiv.
ru: Когда Python-кода становится слишком много, лучше записывать его в файлы. Это, например, позволит тебе редактировать отдельные части кода (исправлять ошибки) и тут же запускать их без необходимости перепечатывать текст. Просто сохрани код в файл, и передай его имя :program:`python`'у. Записанный в файл исходный код будет выполнен без запуска интерактивного интерпретатора.

source: **Let's try that**. Create a file :file:`hello.py` in your current directory with your favorite text editor and write the print command from above. Now save that file. On Linux or OS X, you can also run ``touch hello.py`` to create an empty file to edit. To run this file with python, it's pretty easy:
ko: **다음을 해보기로 하죠**. :file:`hello.py` 파일을 즐겨 사용하는 텍스트 편집기로 현재 디렉터리에 만들고 위에 작성한 프린트 명령을 작성해보세요. 이제 파일을 저장하세요. 리눅스나 OS X에서는 ``touch hello.py``를 실행해서 편집할 빈 파일을 만들 수 있어요. 파이썬으로 파일을 실행한다면, 굉장히 쉬워요:
ro: **Să încercăm asta**. Creează un fișier :program:`python` în directorul curent utilizând editorul tău favorit și scrie comanda print de mai sus. Acum salvează acest fișier. În Linux sau OS X poți de asemenea să utilizezi ``touch hello.py`` pentru a creea un fișier gol pentru editare. Este foarte ușor să execuți acest fișier cu Python:
ru: **Давай попробуем сделать это**. С помощью своего любимого текстового редактора создай файл :file:`hello.py` в текущей директории и запиши в него программу команду, выводящую фразу "Hello world", из примера выше. На GNU/Linux или OS X также можно выполнить команду ``touch hello.py``, чтобы создать пустой файл для последующего редактирования. Выполнить сохранённую в файле программу проще простого:

source: Make sure you are at your system command prompt, which will have ``$`` or ``>`` at the end, not at python's (which has ``>>>`` instead)!
es_cl: Asegúrese de estar en la línea de comandos del sistema, el cual tendrá el símbolo ``$`` o ``>`` al final, no el símbolo del intérprete de python (que en cambio tiene ``>>>``)!
ko: 마지막에 파이선 프롬프트가 아니라(```>>>``` 표시가 있어요), ``$``나 ``>``가 있는 시스템 명령 프롬프트에 있는지 확인해보세요!
ro: Asigură-te că ești în promput-ul sistemului, care are ``$`` sau ``>`` la sfârșit, nu în cel al lui Python (care se termină cu ``>>>``)!
ru: Для начала убедись, что ты находишься в командной строке (на конце строк должны находиться символы ``$`` или ``>``, а не ``>>>``, как в интерактивной оболочке Python).

source: On Windows you should also be able to double-click the Python file to run it.
es_cl: En Windows usted podrá también hacer doble click sobre el archivo para ejecutarlo.
ko: 윈도우에서는 파이선 파일을 두 번 눌러서 실행할 수 있어요.
ro: În Windows ar trebui să poți da dublu clic pe fișierul Python pentru a îl executa.
ru: В Windows нужно два раза кликнуть на пиктограмму файла, чтобы запустить его.

source: When pressing :kbd:`Enter` now, the file is executed and you see the output as before. But this time, after Python finished executing all commands from that file it exits back to the system command prompt, instead of going back to the interactive shell.
ko: 이제 :kbd:`Enter` 키를 누르면, 파일을 실행하고 이전에 본 출력 내용을 볼 수 있어요, 근데 지금은 파이썬이 파일에 있는 모든 명령을 다 실행한 다음에 대화 쉘로 돌아가는 대신, 시스템 명령 프롬프트로 빠져나와요.
ro: Acum, când apeși :kbd:`Enter`, fișierul este executat și vei vedea rezultatul ca și mai devreme. Dar de data aceasta, dupa ce Python va termina de executat toate comenzile din acest fișier va ieși din nou la prompt-ul sistemului, în loc să se întoarcă la shell-ul interactiv.
ru: Когда ты нажмешь <Enter> в консоли, наш файл выполнится и результат его работы будет выведен на экран. В этот момент интерпретатор Python выполнит все инструкции, находящиеся в скрипте и вернет управление командной строке, а не интерактивной оболчке Python.

source: And now we are all set and can get started with turtle!
es_cl: Y ahora tenemos todo preparado y podemos comenzar con tortuga!
ko: 그리고 이제 더 설정했으니 거북이를 가지고 시작해보기로 하죠!
ro: Și acum suntem pregătiți și putem incepe cu țestoasa!
ru: Теперь всё готово, и мы можем приступить к черепашке!

source: Not getting "Hello world" but some crazy error about "can't open file" or "No such file or directory?" Your command line might not be running in the directory you saved the file in. You can use the system command line to change your active directory with the :command:`cd` command, which stands for "change directory". On Windows, you might want something like::
es_cl: El no obtener "Hello world", sino algún mensaje de error extraño acerca de "no se puede abrir el archivo" o "No existe el archivo o directorio", puede ser que su línea de comandos de sistema no está corriendo en el directorio en que guardó el archivo. Usted puede utilizar la línea de comandos del sistema para cambiar su directorio activo con el comando :command:`cd`, el cual significa "cambiar directorio". En Windows, usted puede querer hacer algo como::
ko: "Hello world"가 뜨지 않고 "can't open file" 또는 "No such file or directory"같은 미치게 만드는 오류가 뜨나요? 파일을 저장한 디렉터리에서 실행이 안될 수도 있어요. 시스템 명령 줄에서 :command:`cd` 명령을 사용해서 현재 활성 디렉터리를 바꿀 수 있어요. 이 명령은 "change directory"를 의미해요. 윈도우에서는 다음과 같이 되겠죠::
ro: Nu obții "Hello world" ci o eroare ciudată despre "can't open file" (nu pot deschide fișierul) sau "No such file or directory" (nu există un asemenea fișier sau director)? Linia ta de comandă este posibil să nu se execute în directorul unde ai salvat fișierul. Poți să folosești linia de comandă pentru a schimba directorul activ cu comanda :command:`cd`, care semnifică "change directory" (schimbă directorul). În Windows, probabil vei dori ceva gen:
ru: Вместо ожидаемого "Hello world" ты получил какие-то странные ошибки "can't open file" или "No such file or directory"? Скорее всего, что ты работаешь не в той директории где сохранен твой Pyhton-скрипт. С помощью командной строки легко сменить текущий активный каталог, используя команду :command:`cd`, что означает "change directory" (сменить каталог). В Windows эта команда может выглядеть так:

source: On Linux or OS X, you might want something like:
es_cl: En OS X o Linux, usted puede querer ejecutar algo como:
ko: 리눅스나 OS X에서는 다음 처럼 나타날거예요:
ro: În Linux sau OS X vei vrea ceva de genul:
ru: В Linux или OS X:

source: This changes to the directory Python_Exercises under the Desktop folder (yours might be somewhere a bit different). If you don't know the location of the directory where you saved the file, you can simply drag the directory to the command line window. If you don't know which directory your shell is currently running in use :command:`pwd`, which stands for "print working directory".
es_cl: Esto cambia al directorio Python_Exercises dentro del directorio Desktop (el suyo puede ser algo relativamente distinto). Si usted no conoce el directorio donde guardó el archivo, usted puede simplemente arrastrar el directorio a la ventana de la línea de comandos. Si usted no sabe en que directorio se encuentra actualmente ejecutando su consola, use el comando :command:`pwd` el cual significa "imprima el directorio de trabajo" por sus siglas en inglés.
ko: 이 명령으로 Desktop 폴더의 Python_Exercises 디렉터리로 바뀌어요(어디에 있느냐에 따라 다를 수도 있어요). 파일을 어디에 저장하는디 디렉터리 위치를 모르겠다면 그냥 디렉터리를 명령행 창에 끌어다 넣으세요. 쉘이 돌아가는 디렉터리의 위치가 어딘지 잘 모르겠다면 "print working directory"를 의미하는 :command:`pwd` 명령을 활용하세요.
ro: Asta schimba directorul în directorul Python_Exercises sub directorul Desktop (al tău este posibil să fie ușor diferit). Dacă nu știi locația directorului unde ai salvat fișierul poți pur și simplu să tragi directorul în fereastra cu linia de comandă. Dacă nu știi în ce director se află shell-ul utilizează comanda :command:`pwd`, care semnifică "print working directory" (afișează directorul utilizat).
ru: С помощью этой команды мы перейдем в папку Python_Exercises, которая находиться в папке Desktop (конечно же, на твоем компьютере названия папок будут отличаться). Если ты не знаешь путь к каталогу, где ты сохранил свой файл, попробуй просто перетащить папку в окно консоли. А если ты не знаешь в какой папке ты сейчас находишься в консоли - воспользуйся командой :command:`pwd`, которая означает "print working directory" (показать активную директорию).

source: When playing around with turtle, avoid naming your file :file:`turtle.py` --- rather use more appropriate names such as :file:`square.py` or :file:`rectangle.py`. Otherwise, whenever you refer to ``turtle``, Python will pick up *your* file instead of the standard turtle.
es_cl: Cuando juegue con tortuga, evite nombrar el archivo :file:`turtle.py` --- en vez de esto use nombres más apropiados como :file:`cuadrado.py` o :file:`rectangulo.py`. De otra manera, cada vez que usted se refiera a ``turtle``, Python escogerá *su* archivo en vez del archivo estándar turtle.
ko: 거북이를 가지고 놀 때, :file:`turtle.py` 파일 이름으로 저장하는건 피해주세요. 대신 :file:`square.py` 또는 :file:`rectangle.py`같은 적당한 이름으로 지어주세요. 그렇지 않으면 ``turtle``을 참조할 때, 파이썬에서는 기존의 거북이 대신 *여러분*의 파일을 가져와요.
ro: Când te joci cu țestoasa, evită să denumești fișierul tău :file:`turtle.py` --- mai degrabă folosește nume mai potrivite ca :file:`square.py` sau :file:`rectangle.py`. În caz contrar, de fiecare dată cănd te referi la ``turtle`` (țestoasă), Python va alege fișierul *tău* în loc de țestoasa standard.
ru: Эксперементируя с черепашкой, не называй рабочий файл :file:`turtle.py` --- лучше выбрать более подходящие имена, такие как :file:`square.py` или :file:`rectangle.py`, иначе при обращении к ``turtle`` Python будет использовать твой файл вместо ``turtle`` из стандартной библиотеки.
