Repository: OpenTechSchool/python-beginners
Catalog: source/locale/*/LC_MESSAGES/logical_operators.po
Languages: es_cl, ko, ro

source: Logical operators
es_cl: Opreadores Lógicos
ko: 논리 연산자
ro: Operatori logici

source: Introduction
es_cl: Introducción
ko: 소개
ro: Introducere

source: Conditionals are a nice way to make decisions by asking if something equals *True* or not. But often one condition is not enough. We may want to take the opposite of our result. Or for instance if we want to make a decision upon ``turtle.xcor()`` and ``turtle.ycor()`` we have to combine them. This can be done with logical operators.
es_cl: Los condicionales son una muy buena forma de tomar decisiones preguntando si algo es igual a *True* o no. Pero a menudo una condición no es suficiente. Podríamos querer tomar lo opuesto a nuestro resultado. O por ejemplo si queremos tomar una decisión sobre ``turtle.xcor()`` y ``turtle.ycor()`` debemos combinarlos. Esto puede realizarse con operadores lógicos.
ko: 조건문은 어떤 조건이 *True*인지 아닌지 요청하여 결정하는데 좋은 방법이긴 해요. 근데 하나의 조건 가지고는 충분하지 않을 때가 자주 있죠. 아마 결과의 반대를 취하려 할거예요. 아니면 ``turtle.xcor()`` 랑 ``turtle.ycor()`` 로 결정하려 한다면 이걸 결합해야 해요. 논리 연산자를 쓰면 해결할 수 있어요.
ro: Condițiile sunt o formă comodă de a lua decizii întrebându-ne dacă ceva are valoare *Adevărat* sau nu. Dar de multe ori o condiție nu e suficientă. Am putea dori să facem opusul. Sau de exemplu dacă dorim să luăm o decizie bazată pe ``turtle.xcor()`` și``turtle.ycor()`` atunci trebuie să le combinăm. Asta se poate rezolva cu operatori logici.

source: Negation of a statement
es_cl: Negación de una sentencia
ko: 조건의 부정
ro: Negarea unei declarații

source: If we want something to be *False* we can use ``not``. It is a logical operator::
es_cl: Si queremos que algo sea *False* podemos usar ``not``. Es un operador lógico::
ko: 무언가 *False*로 되돌리고 싶으면 ``not``을 쓸 수 있어요. 이건 논리 연산자거든요::
ro: Dacă dorim ca ceva să fie *Fals* putem utiliza ``not``. Este un operator logic:

source: Exercise
es_cl: Ejercicio
ko: 연습
ro: Exercițiu

source: The turtle gives us a useful function to know if it is drawing or not: ``turtle.isdown()``. This function returns *True* if the turtle is drawing. As we have seen earlier, the function ``turtle.penup()`` and ``turtle.pendown()`` toggle between drawing while moving, or just moving without a trace.
es_cl: El programa turtle nos da una función muy útil para saber si se está dibujando o no: ``turtle.isdown()``. Esta función retorna *True* si la tortuga está dibujando. Como hemos visto anteriormente, la función ``turtle.penup()`` y ``turtle.pendown()`` conmuta entre dibujar mientras se está moviendo, o solo moverse sin dejar trazo.
ko: 거북이가 화면을 지나가면서 그렸는지 안그렸는지 확인하도록 쓸모있는 함수를 주는데요, 그걸 ``turtle.isdown()``이라고 하겠습니다. 이 합수는 거북이가 그림을 그리면 *True* 값을 반환해요. 앞에서 보신대로 ``turtle.penup()`` 과``turtle.pendown()`` 토글 함수는 움직이는 동안 그릴것이냐, 그리지 않고 그냥 움직이기만 할 것이냐의 상태를 바꾸어요.
ro: Țestoasa ne pune la dispoziție o funcție utilă pentru a ști dacă desenează sau nu: ``turtle.isdown()``. Această funcție returnează *Adevărat* dacă țestoasa desenează. După cum am văzut mai devreme, funcțiile ``turtle.penup()`` și ``turtle.pendown()`` schimbă între desen și mișcare, sau doar mișcare fără a trasa nici o urmă.

source: Can we write a function that only goes forward if the pen is up?
es_cl: Podemos escribir una función que permita ir adelante solamente si el lápiz está levantado?
ko: 단순히 펜을 들었을때 전진만하는 함수를 작성할 수 있을까요?
ro: Putem scrie o funcție care înaintează doar dacă penița este ridicată?

source: Solution
es_cl: Solución
ko: 해결책
ro: Soluție

source: This and that or something else
es_cl: Esto, aquello u otra cosa
ko: 이거 저거 아니면 다른거요
ro: Asta și aia sau altceva

source: Two easy to understand operators are ``and`` and ``or``. They do exactly what they sound like:::
es_cl: Dos operadores fáciles de entender son ``and`` y ``or``. Ellos hacen exactamente lo que dicen sus nombres:::
ko: 이해하기 쉬운 두 개의 연산자로는 ``and``랑 ``or``가 있어요. 말 그대로 동작해요:::
ro: Doi operatori ușor de înțeles sunt ``and`` (și) și ``or`` (sau). Ei fac exact ce spune numele lor:

source: You are not restricted to one logical operator. You can combine as may as you want.
es_cl: No está restringido a un operador lógico. Puede combinar tantos como quiera.
ko: 하나의 논리 연산자를 쓰는데 제한을 받진 않아요. 원하는 대로 붙일 수 있어요.
ro: Nu ești limitat la un singur operator logic. Poți combina oricâți de mulți dorești.

source: Earlier we put the turtle in a circular prison. This time let's make it a box. If the turtle goes more than 100 in the X *or* Y axis then we turn the turtle back around to the center.
es_cl: Antes pusimos a la tortuga en una prisión circular. Ahora hagamos la prisión cuadrada. Si la tortuga intenta ir a más de 100 en el eje X *or* en el eje Y, entonces retornemos a la tortuga de vuelta al centro.
ko: 이미 원형 감옥에 거북이를 놓았었어요. 이제 상자를 만들어보기로 하겠어요. 거북이가 X *or* Y 방향으로 100 이상을 가면, 거북이를 가운데 주변으로 다시 돌려놓겠어요.
ro: Mai devreme am pus țestoasa într-o închisoare circulară. De această dată să o punem într-o cutie. Dacă țestoasa merge mai mult de 100 pe axele X *sau* Y atunci întoarcem țestoasta înapoi spre centru.
