Repository: OpenTechSchool/python-beginners
Catalog: source/locale/*/LC_MESSAGES/loops.po
Languages: de, es_cl, ko, ro

source: Loops
de: Schleifen
ko: 순환
ro: Bucle

source: Introduction
de: Einführung
es_cl: Introducción
ko: 소개
ro: Introducere

source: Something you might have noticed: our programs often feature repetition. Python has a powerful concept it makes use of called looping (jargon: *iteration*), which we can use to cut out our reptitive code! For now, **try this easy example**::
de: Wie du sicher bemerkt hast, enthalten unsere Programme oft Wiederholungen. In Python gibt es ein mächtiges Konzept genannt Schleifen (Jargon: Iterationen), welches wir später genauer erkunden werden. Probieren wir doch zunächst mal dieses simple Beispiel aus::
es_cl: Algo que debe haber notado: nuestros programas a menudo muestran repeticiones. Python posee un concepto poderoso, hace uso del llamado looping (ciclos, o en herga *iteraciones*), el cual podemos usar para acortar el código repetitivo! Por ahora **intente este fácil ejemplo**::
ko: 아마 다음과 같은걸 본 적이 있을거예요: 우리 프로그램엔 자주 반복하는 기능이 있어요. 파이썬엔 순환 반복(용어: *반복*)이라고 하는 강력한 개념이 있는데, 반복 코드 일부를 똑 떼어내는데 사용할 수 있어요! 자, 그러면 **이 간단한 예제를 해보도록 해요**::
ro: Ceva ce este posibil să fi observat: programele adeseori au nevoie de repetiții. Python are un concept puternic pe care îl utilizează, numit bucle (în jargon: *iterații*), care poate fi folosit pentru a reduce codul repetitiv! Pentru moment, **încearcă acest exemplu simplu**:

source: This is incredibly helpful if we want to do something multiple times --- say, drawing the individual border lines of a shape --- but only want to write that action once. Here's another version of a loop::
de: Dies ist außerordentlich hilfreich wenn wir etwas mehrere Male tun möchten --- beispielsweise die Umrandung einer geometrischen Form zeichnen --- aber den Programmcode dafür nur einmal schreiben möchten. Hier ist eine andere Version einer Schleife::
es_cl: Esto es increíblemente útil si queremos hacer algo muchas veces --- por ejemplo, dibujar las líneas borde individuales de una figura --- pero solo queremos escribir la acción una vez. Acá hay otra versión de un loop::
ko: 무언가를 여러번 돌리고 싶을때 매우매우 도움이 돼요 --- 도형의 테두리선을 각각 그릴 경우 말이죠? --- 근데 동작은 단 한번에 대해서만 적고 싶을 때가 있어요. 순환 반복의 다른 버전을 보도록 할께요::
ro: Este incredibil de util dacă dorim să facem ceva de mai multe ori -- să spunem, să desenăm separat marginile unei forme -- dar dorim să scriem acea acțiune o singură dată. Iată o altă versiune de buclă:

source: Notice how we write only one line of code using ``i``, but it takes on 10 different values?
de: Beachte dass wir nur eine einzige Programme Zeile mit ``i`` schreiben, es aber 10 unterschiedliche Werte annimmt.
es_cl: Note como escribimos una sola línea de código usando ``i``, pero este toma 10 valores diferentes?
ko: 이제 어떻게 ``i`` 변수를 사용해서 코드 한 줄을 작성하더라도 각기 다른 10가지 값을 가질 수 있는지 볼까요?
ro: Observați cum scriem doar o linie de cod folosind ``i``, dar ia zece valori diferite?

source: The :samp:`range(n)` function can be considered a shorthand for ``0, 1, 2, ..., n-1``. If you want to know more about it, you can use the help in the Python shell by typing ``help(range)``. Use the :kbd:`q` key to exit the help again.
de: Die :samp:`range(n)`\ -Funktion kann man als eine Abkürzung für ``0, 1, 2, ..., n-1`` sehen. Falls du mehr über sie wissen möchtest kannst du die Hilfe im Pythoninterpreter benutzen indem du ``help(range)`` tippst. Benutz die :kbd:`q`\ -Taste um die Hilfe wieder zu verlassen.
es_cl: La función :samp:`range(n)` puede ser considerado un atajo para ``0, 1, 2, ..., n-1``. Si quiere saber más acerca de ella , puede usar la ayuda en la consola de Python escribiendo ``help(range)``. Use la tecla :kbd:`q` para salir de la ayuda.
ko: :samp:`range(n)` 함수는 ``0, 1, 2, ..., n-1``을 짧게 줄인걸로 볼 수 있어요. 더 알아보시려면 파이썬 쉘에서 ``help(range)``를 쳐서 도움말을 보실 수 있어요. :kbd:``q`` 키를 사용하면 도움말에서 다시 나갈 수 있어요.
ro: Funcția :samp:`range(n)` poate fi considerată o prescurtare pentru ``0, 1, 2, ..., n-1``. Dacă dorești să afli mai mult, poți folosi documentația din interpretorul Python scriind ``help(range)``. Folosește tasta :kbd:`q` pentru a ieși din documentație.

source: You can also loop over elements of your choice::
de: Du kannst auch Elemente Deiner Wahl in einer Schleife verarbeiten::
es_cl: Puede también hacer un ciclo entre los elementos que escoja::
ko: 여러분이 고른 요소에 대해서도 순환 반복 동작을 할 수 있어요::
ro: Poți de asemenea sa treci prin elemente la alegere:

source: Write this example out and run it with python, to check it works how you might expect.
de: Schreib das Beispiel aus und führ es mit Python aus um zu überprüfen, ob es so funktioniert wie du möchtest.
es_cl: Escriba el siguiente ejemplo y ejecútelo con Python, verifique que funciona como usted esperaba.
ko: 이 예제 코드를 그대로 작성하고 파이선으로 실행해서, 여러분이 기대한 바와 동작이 같은지 확인해보세요.
ro: Scrie acest exemplu și încearcă-l cu Python, ca să vezi dacă merge așa cum te aștepți.

source: Notice how above, the lines of code that are *looped*, are the ones that are *indented*. This is an important concept in Python - that's how it knows which lines should be used in the ``for`` loop, and which come after, as part of the rest of your program. Use four spaces (hitting tab) to indent your code.
de: Beachte wie oben die Zeilen, die *wiederholt* werden, die sind die *eingerückt* sind. Das ist ein wichtiges Konzept in Python - das ist wie es weiß welche Zeilen zur ``for``\ -Schleife gehören und welche danach kommen, als Rest des Programms. Benutz vier Leerzeichen (drück Tab) um deinen Quelltext einzurücken.
es_cl: Note como arriba, las líneas de código que han sido *iteradas*, son las que estan *indentadas*. Esto es un concepto importante en Python - es así como sabe que líneas deben ser usadas en el loop ``for``, y que viene después, como parte del resto del programa. Use cuatro espacios (presionando Tab) para indentar el código.
ko: 위에서 어떻게 돌아가는지 보시면, *순환 반복*하는 코드 줄을 *들여쓰기* 했어요. 파이선에 있어 중요한 개념이죠. 어떤 코드 줄이 ``for`` 순환 반복 구문에서 사용해야 하는지 알 수 있기도 하고, 그 다음 프로그램 나머지 부분에는 어떤 요소가 따라오는지 알 수 있기도 하죠. 코드를 들여쓰기 하려면 공백 문자 네 개(그냥 탭 키를 치세요)를 사용하세요.
ro: Este de remarcat cum mai sus, liniile de cod care sunt parte a *buclei* sunt cele care sunt *indentate*. Acesta este un concept important în Python - așa știe care linii fac parte din bucla ``for``, și care vin după, ca parte a restului programului. Utilizează patru spații (apasând tasta :kbd:`TAB`) pentru a indenta codul tău.

source: Sometimes you want to repeat some code a number of times, but don't care about the value of the ``i`` variable; so it can be good practice to replace it with ``_`` instead. This signifies that we don't care about its value, or don't wish to use it. Here's a simple example::
de: Manchmal möchtest du Code wiederholen aber scherst dich nicht um den Wert von der Variable ``i``; hier bietet es sich an diese durch ``_`` zu ersetzen. Das macht deutlich, dass uns der Wert egal ist, oder wir ihn nicht benutzen. Hier ist ein einfaches Beispiel::
es_cl: Algunas veces querrá repetir algún código un número de veces, pero no le importa el valor de la variable ``i``; entonces puede ser una buena práctica reemplazarla con ``_``. Esto significa que no nos interesa este valor, o no lo queremos usar. Acá hay un ejemplo simple::
ko: 어떤 경우는 일부 코드를 여러번 반복하려 하지만 ``i`` 변수 값은 신경 쓰고 싶지 않을때가 있어요. 이때는 ``_``를 대신 사용하는게 좋은 습관이 될 수 있어요. 이걸 쓰면 값이 어떤지 신경 쓰고 싶지도 않고 쓰고 싶지도 않음을 의미해요. 간단한 예를 보여드릴께요::
ro: Uneori vrei să repeți o bucată de cod de mai multe ori, dar nu te interesează valoarea variabilei ``i``; în acest caz este o bună practică să o înlocuiești cu ``_``. Asta înseamnă că nu te interesează valoarea, sau că nu dorești să o utilizezi. Iată un exemplu simplu:

source: You may or may not be wondering about the variable ``i`` - why is it used all the time above? Well, it simply stands for "index" and is one of the most common variable names ever found in code. But if you are looping over something other than just numbers, be sure to name it something better! For instance::
de: Du magst dich vielleicht über die Variable ``i`` wundern oder auch nicht -- warum wird sie oben die ganze Zeit verwendet? Nunja, sie steht einfach für "index" und ist der häufigste Variablenname den man überhaupt in Quelltext findet. Aber wenn du eine Schleife über etwas anderes als nur Zahlen ausführst, wähle besser einen anderen Namen. Zum Beispiel::
es_cl: Puede o no importarle la variable ``i`` - por qué es usada todo el tiempo arriba? bueno, simplemente representa "índice" y es uno de los nombres más comunes de variables encontrados en códigos. Pero si está haciendo un ciclo sobre otra cosa que no sean números, asegurese de darle un mejor nombre! Por ejemplo::
ko: ``i`` 변수가 어떤 값을 지니고 있는지 궁금해 할 수도, 안 할 수도 있어요. 위에서는 왜 항상 사용했을까요? 흠, 간단하게 말하자면 "인덱스"를 의미하는데 대부분의 코드 어디에서든 찾을 수 있는 일반적인 변수 이름일 뿐이예요. 어떤 숫자가 아니라 다른 기준 이상으로 순환 반복을 한다면, 이름을 확인해보는게 좋아요! 가령 다음 같으면요::
ro: Poți să te întrebi sau nu despre variabila ``i`` - de ce e folosită de fiecare dată? Ei bine, semnifică "index" și este unul dintre cele mai folosite nume de variabile întâlnite în cod. Dar dacă iterezi peste altceva decât numere, asigură-te că îi dai un nume mai bun! De exemplu:

source: This is immediately clearer to understand than if we had used ``i`` instead of ``drink``.
de: Das ist sofort klarer zu verstehen als wenn wir ``i`` statt ``drink`` benutzt hätten.
es_cl: Esto es claro de forma inmediata y se comprende mejor que si hubiésemos usado ``i`` en vez de ``drink``.
ko: ``drink`` 대신에 ``i``를 썼을때보다는 바로 이해하기에 확실하죠.
ro: Este cu mult mai ușor de înțeles decât dacă am fi folosit ``i`` în loc de ``drink``.

source: Drawing a dashed line
de: Eine gestrichelte Linie zeichnen
es_cl: Dibujando una línea discontínua
ko: 점선을 그려보아요
ro: Desenarea unei linii întrerupte

source: Exercise
de: Übung
es_cl: Ejercicio
ko: 연습
ro: Exercițiu

source: Draw a dashed line. You can move the turtle without the turtle drawing its movement by using the ``turtle.penup()`` function; to tell it to draw again, use ``turtle.pendown()``.
de: Zeichne eine gestrichelte Linie. Du kannst die Schildkröte bewegen ohne dass sie zeichnet, indem Du die Funktion ``turtle.penup()`` aufrufst; um sie wieder zeichnen zu lassen, verwende ``turtle.pendown()``.
es_cl: Dibuje una línea discontínua. Puede mover la tortuga sin que esta dibuje su movimiento usando la función ``turtle.penup(); para que vuelva a dibujar, use la función ``turtle.pendown()``.
ko: 점선을 그려보세요. ``turtle.penup()`` 함수를 사용해서 거북이가 선을 그리지 않고 그냥 움직이게만 할 수 있어요. 다시 그리라고 하려면 ``turtle.pendown()``을 활용하세요.
ro: Desenează o linie întreruptă. Poți mișca țestoasa fără ca aceasta să deseneze utilizând funcția ``turtle.penup()`` (ridică penița); pentru ca aceasta să deseneze din nou, folosește ``turtle.pendown()`` (penița jos).

source: Solution
de: Lösung
es_cl: Solución
ko: 해결책
ro: Soluția

source: Bonus
ko: 덤
ro: Supliment

source: Can you make the dashes become larger as the line progresses?
de: Kannst du die Striche immer größer werden lassen?
es_cl: ¿Puede hacer que los trazos se hagan cada vez más largos mientras la línea progresa?
ko: 한 줄 한 줄 처리할 때마다 대시 길이를 더 늘릴 수 있나요?
ro: Poți face dungile să fie mai lungi pe măsură ce desenezi linia?

source: Feeling lost? Inspect ``i`` at every run of the loop::
de: Verwirrt? Schau dir ``i`` in jedem Schleifendurchlauf an::
es_cl: Se siente perdido? Revise ``i`` en cada iteración del ciclo::
ko: 뭔가 부족한가요? 모든 순환 반복 실행 부분에 ``i``를 넣어보세요::
ro: Te-ai încurcat? Inspectează valoarea lui ``i`` la fiecare rulare a buclei:

source: Can you utilize ``i`` --- commonly called the **index** variable or loop variable --- to get increasing step sizes?
de: Kannst du ``i`` --- üblicherweise als **Index**\ - oder Schleifenvariable bezeichnet --- benutzen um immer größere Schritte zu machen?
es_cl: Puede utilizar ``i`` --- comúnmente llamada la variable **índice** o variable del loop --- para incrementar los tamaños de los trazos?
ko: 크기를 단계적으로 늘이는데 ``i``를 활용할 수 있나요? 보통 순환 반복 변수라고 하거나 **인덱스** 변수라고 해요.
ro: Poți utiliza ``i`` --- numită uzual variabila **index** sau de iterație --- pentru a obține pași din ce în ce mai mari?

source: Comments
de: Kommentare
es_cl: Comentarios
ko: 주석
ro: Comentarii

source: In the example above, the line that starts with a ``#`` is called a comment. In Python, anything that goes on a line after ``#`` is ignored by the computer. Use comments to explain what your program does, without changing the behaviour for the computer. They can also be used to easily and temporarily disable, or "comment out" some lines of code.
de: Im obigen Beispiel wird die Zeile die mit ``#`` anfängt ein Kommentar genannt. In Python wird alles das auf der Zeile nach ``#`` folgt ignoriert. Benutz Kommentare um zu erklären was dein Programm macht ohne das Programmverhalten zu verändern. Sie können auch benutzt werden um kurzzeitig Quelltext zu deaktiveren, oder "auszukommentieren".
es_cl: En el ejemplo de arriba, la línea que parte con un ``#`` es llamada comentario. En Python, cualquier cosa que vaya en una linea después de un ``#`` es ignorado por el computador. Use comentarios para explicar que hace su programa, sin cambiar el comportamiento para el computador. Se pueden usar también para fácil y temporalmente deshabilitar o "comentar" algunas líneas de código.
ko: 위의 예제에서 ``#``으 시작하는 줄을 주석이라고 해요. 파이썬에서는 ``#``으로 시작하는 줄은 컴퓨터에서 무시해요. 컴퓨터에서 동작을 바꾸지 않고 프로그램이 어떤 동작을 하는지 설명하려면 주석을 활용하세요. 잠깐 동안 쉽게 코드를 비활성화 하든지 코드 일부를 "주석 처리" 해버리는데 사용할 수도 있어요.
ro: În exemplul de mai sus, linia care începe cu ``#`` este numită un comentariu. În Python, orice urmează pe o linie după ``#`` este ignorat de calculator. Folosește comentarii pentru a explica ce face programul tău, fără a schimba modul de comportare al calculatorului. Pot fi folosite și pentru a dezactiva rapid și temporar, sau a "comenta", linii de cod.

source: Comments can also go at the end of a line, like this::
de: Kommentare können auch an das Zeilenende gepackt werden, wie hier::
es_cl: Los comentarios pueden ir también al final de una línea, por ejemplo::
ko: 다음 처럼 줄 끝으로 주석이 들어갈 수도 있어요::
ro: Comentariile pot fi puse de asemenea la sfârșitul unei linii, așa:

source: More Efficient Squares
de: Effizientere Quadrate
es_cl: Cuadrados más Eficientes
ko: 더 효율적인 사각형
ro: Pătrate mai eficiente

source: The squares we were drawing at the start of this tutorial had a lot of repeated lines of code. Can you write out a square drawing program in fewer lines by utilizing loops?
de: Die Quadrate die wir am Anfang des Materials gemalt haben erforderten viele wiederholten Quelltextzeilen. Kannst du ein Programm zum Malen von Quadraten mit weniger Zeilen schreiben wenn du Schleifen benutzt?
es_cl: Los cuadrados que hemos dibujado al comienzo de este tutorial tienen un montón de líneas de código repetidas. ¿Puede escribir un programa que dibuje cuadrados en menos líneas, utilizando loops?
ko: 이 따라하기 안내서 앞부분에 그렸던 사각형에는 선을 반복해서 그리는 코드가 많이 있었어요. 순환 반복 구문을 활용해서 사각형을 그리는 프로그램의 줄 수를 줄여 볼 수 있죠?
ro: Pătratele pe care le desenam la începutul acestui curs aveau multe linii de cod repetate. Poți scrie un program de desenare pătrate în mai puține linii de cod utilizând bucle?

source: Try *nesting* loops, by putting one right under (*inside*) the other, with some drawing code that's inside both. Here's what it can look like::
de: Probier Schleifen zu *verschachteln* (*nesting*) indem du eine direkt in die andere packst, mit einigen Malanweisungen die in beiden drin sind. Das könnte in etwa so aussehen::
es_cl: Intente *anidar* loops, poniendo uno justo bajo (*dentro*) el otro, con algo de código de dibujo que se encuentre dentro de ambos. Acá puede ver cómo puede lucir::
ko: 다른 순환 반복 구문의 아래(*안*)에 순환 반복 구문을 놓는 *중첩* 순환 반복 구문을 활용하고, 그리는 코드를 두 순환 반복 구문 안에 놓아보세요. 어떻게 보일 수 있을지 보여드릴께요::
ro: Încearcă să faci bucle *imbricate*, punând una chiar după (*înăuntrul*) alteia, cu câteva comenzi de desen care aparțin amândorura. Uite cum poate arăta:

source: Replace the ``...``'s with your own code, and see if you can come up with something funny or interesting! :sup:`Mistakes are encouraged!`
de: Ersetz ``...`` mit deinem eigenen Quelltext und schau, ob du etwas lustiges oder interessantes erstellen kannst. :sup:`Fehler sind erwünscht!`
es_cl: Reemplace los ``...`` con su propio código, y vea si puede obtener algo divertido o interesante! :sup:`Errores son estimulantes!`
ko: ``...``를 여러분이 작성한 코드로 바꾸고, 어떤 재밌는 또는 흥미로운 모습을 만들어냈는지 보세요! :sup:`실수해도 좋아요!`
ro: Înlocuiește ``...`` cu codul tău, și vezi dacă poți obține ceva drăguț sau interesant! :sup:`Este în regulă să greșești!`
