Repository: OpenTechSchool/python-beginners
Catalog: source/locale/*/LC_MESSAGES/simple_drawing.po
Languages: ko, ro

source: Simple drawing with turtle
ko: 거북이로 간단하게 그리기
ro: Desenarea simplă utilizând țestoasa

source: Introduction
ko: 소개
ro: Introducere

source: Turtle is like a drawing board.
ko: Turtle은 그림판이랑 비슷합니다.
ro: Țestoasa este ca o planșetă de desen.

source: It has functions like ``turtle.forward(...)`` and ``turtle.left(...)`` which can move the turtle around.
ko: 거북이를 움직일 수 있는 ``turtle.forward(...)``와 ``turtle.left(...)``같은 함수가 있어요.
ro: Are funcții ca ``turtle.forward(...)`` și ``turtle.left(...)``, care pot mișca țestoasa.

source: Before you can use turtle, you have to import it. We recommend playing around with it in the interactive interpreter first, as there is an extra bit of work required to make it work from files. Just go to your terminal and type::
ro: Înainte de a utiliza țestoasa, aceasta trebuie importată. Îți recomandăm sa te joci cu ea în mod interactiv pentru început, deoarece va fi nevoie de cateva lucruri suplimentare pentru a o face să funcționeze din fișiere. Deschide un terminal și scrie:

source: Not seeing anything on Mac OS? Try issuing a command like ``turtle.forward(0)`` and looking if a new window opened behind your command line.
ko: Mac OS에서 아무것도 안보인다구요? ``turtle.forward(0)`` 같은 명령을 실행해서 명령행 뒤에 새 창이 열렸는지 확인해보세요.
ro: Nu vezi nimic în MacOS? Încearcă să dai o comandă ca `turtle.forward(0)`` și să verifici dacă s-a deschis o fereastră nouă în spatele liniei de comandă.

source: Do you work with Ubuntu and get the error message "No module named _tkinter"? Install the missing package with ``sudo apt-get install python3-tk``
ko: 우분투에서 실행할 때 "No module named _tkinter" 오류 메시지가 나온다구요? ``sudo apt-get install python3-tk``로 빠진 꾸러미를 설치하세요.
ro: Utilizezi Ubuntu și primești mesajul "No module named _tkinter"? Instaleaza modulul lipsă cu ``sudo apt-get install python3-tk``

source: While it might be tempting to just copy and paste what's written on this page into your terminal, we encourage you to type out each command. Typing gets the syntax under your fingers (building that muscle memory!) and can even help avoid strange syntax errors.
ko: 이 페이지에 적힌 코드를 임시 방편으로 복사해서 붙여넣기보단 각각의 명령을 직접 쳐보세요. 직접 쳤을때 문법도 익히고(근육의 움직임 기억을 만들어요!) 이상한 문법 오류를 막는데도 도움이 돼요.
ro: Deși ai putea fi tentat să copiezi pur și simplu ce este scris în această pagină în terminal, te încurajăm să scrii fiecare comandă. Scrierea îți aduce controlul sintaxei (construind memoria musculară!) și poate chiar să evite erori exotice de sintaxă.

source: The ``turtle.forward(...)`` function tells the turtle to move forward by the given distance. ``turtle.left(...)`` takes a number of degrees which you want to rotate to the left. There is also ``turtle.backward(...)`` and ``turtle.right(...)``, too.
ko: ``turtle.forward(...)`` 함수는 거북이에게 주어진 거리만큼 움직이라고 알려줘요. ``turtle.left(...)`` 함수는 왼쪽 방향으로 주어진 각도만큼 돌으라고 하구요. ``turtle.backward(...)``랑 ``turtle.right(...)``도 있어요.
ro: Funcția ``turtle.forward(...)`` îi spune țestoasei să înainteze distanța specificată. ``turtle.left(...)`` primește un număr de grade cu care vrei să se rotească la stânga. Există de asemenea ``turtle.backward(...)`` și ``turtle.right(...)``.

source: Want to start fresh? You can type ``turtle.reset()`` to clear the drawing that your ``turtle`` has made so far. We'll go into more detail on ``turtle.reset()`` in just a bit.
ko: 깔끔하게 시작하겠다구요? ``거북이``가 이제껏 그린 내용을 지우려 한다면 ``turtle.reset()``를 칠 수 있어요. 이제 ``turtle.reset()``에 대해 좀 더 자세히 이야기해보려고 해요.
ro: Vrei să începi din nou? Poți să scrii ``turtle.reset()`` pentru șterge ce a făcut până acum ``turtle``(țestoasa). O să intrăm în detalii despre ``turtle.reset()`` în scurt timp.

source: The standard turtle is just a triangle. That's no fun! Let's make it a turtle instead with the ``turtle.shape()`` command::
ko: 표준 거북이 모양은 그냥 삼각형입니다. 참 재미없게 생겼죠. ``turtle.shape()`` 명령으로 대신 거북이를 만들어보도록 하겠어요::
ro: Țestoasa standard este un triunghi. Nu e prea drăguț! Hai să o transformăm într-o țestoasă cu comanda ``turtle.shape()``:

source: So much cuter!
ko: 더욱 귀여워졌죠?!
ro: Mult mai drăguț!

source: If you put the commands into a file, you might have recognized that the turtle window vanishes after the turtle finished its movement. (That is because Python exits when your turtle has finished moving. Since the turtle window belongs to Python, it terminates as well.) To prevent that, just put ``turtle.exitonclick()`` at the bottom of your file. Now the window stays open until you click on it::
ko: 파일에 명령을 넣으면 거북이가 이동한 후 거북이 창이 사라진 모습을 보게 돼요(왜냐면 거북이를 다 옮기고 나면 파이선에서 빠져나가기 때문이거든요. 거북이 창은 파이선이 붙들고 있기 때문에 같이 끝나요). 이걸 막으려면 파일 아래에 ``turtle.exitonclick()``를 추가하세요. 그러면 창을 누르기 전에는 열린 상태로 그대로 두게 돼요::
ro: Dacă pui comenzile într-un fișier, poate ai observat că fereastra cu țestoasa dispare după ce țestoasa și-a terminat mișcarea. (Asta deoarece Python se închide după ce țestoasa și-a terminat mișcarea. De vreme ce fereastra țestoasei aparține Pyhon, și aceasta se închide.) Pentru a evita asta, adaugă ``turtle.exitonclick()`` la sfârșitul fișierului tău. Acum fereastra rămâne deschisă pâna cand apeși un buton în ea:

source: Python is a programming language where horizontal indenting of text is important. We'll learn all about this in the Functions chapter later on, but for now just keep in mind that stray spaces or tabs before any line of Python code can cause an unexpected error.
ko: 파이썬은 수평 들여쓰기가 중요한 프로그래밍 언어예요. 다음 장에서 함수에 대해 배우겠지만, 지금은 그냥 파이썬 코드 앞부분에 공백 문자나 탭을 빼먹으면 갑작스런 오류가 있을 수 있다는 사실을 기억해두세요.
ro: Python este un limbaj de programare în care indentarea textului este importantă. O să învățăm despre asta în continuare în capitolul Funcții, dar pentru acum trebuie să reții că spațiile suplimentare sau caracterele tab în fața oricărei linii de cod Python pot genera erori.

source: Drawing a square
ko: 사각형 그리기
ro: Desenarea unui pătrat

source: You're not always expected to know the anwer immediately. Learn by trial and error! Experiment, see what python does when you tell it different things, what gives beautiful (although sometimes unexpected) results and what gives errors. If you want to keep playing with something you learned that creates interesting results, that's OK too. Don't hesitate to try and fail and learn from it!
ko: 언제든 답을 바로 알려고 하진 않을거예요. 그냥 해보고 오류를 일으키면서 배우세요! 여러가지를 호출하면서 파이선이 어떤 동작을 하는지, (가끔은 기대하지 못했더라도)어떤 결과가 보기 좋은지, 어떤 경우에 오류가 나타나는지 경험하세요. 재밌는 결과를 만드는걸 배워서 즐기려고 한다면, 괜찮아요. 배울때 해보고 실패하는걸 망설이지 마세요!
ro: Nu trebuie neapărat să știi de fiecare dată răspunsul din prima! Învață prin încercări repetate! Experimentează, vezi cum reaționează python la diverse comenzi, ce generează rezultate frumoase (deși uneori neașteptate) și ce generează erori. Dacă vrei să te joci în continuare cu ceva ce ai învățat și dă rezultate interesante, este în regulă. Să nu îți fie frică să încerci și să greșești și să înveți din asta!

source: Exercise
ko: 연습
ro: Exercițiu

source: Draw a square as in the following picture:
ko: 다음 그림에 사각형을 그리세요:
ro: Desenează un pătrat ca în figura următoare:

source: For a square you will probably need a right angle, which is 90 degrees.
ko: 사각형을 그리려면 90도 직각 회전이 필요할 수도 있어요.
ro: Pentru un pătrat probabil vei avea nevoie de un unghi drept, care este de 90 de grade.

source: Solution
ko: 해결책
ro: Soluția

source: Notice how the turtle starts and finishes in the same place and facing the same direction, before and after drawing the square. This is a useful convention to follow, it makes it easier to draw multiple shapes later on.
ko: 거북이가 사각형을 그리기 전후에 같은 장소에서 어떻게 움직임을 시작하고 끝내는지, 같은 방향을 어떻게 바라보는지 살펴보세요. 따라하는데 쓸모있는 표기방식이고 나중에 여러가지 도형을 그릴때 쉽게 그릴 수 있도록 도와줘요.
ro: Observă cum țestoasa începe și termină în același loc și cu aceeași orientare la desenarea fiecărui pătrat. Aceasta este o convenție utilă, care ușurează desenarea mai multor forme consecutive.

source: Bonus
ko: 덤
ro: Supliment

source: If you want to get creative, you can modify your shape with the ``turtle.width(...)`` and ``turtle.color(...)`` functions. How do you use these functions? Before you can use a function you need to know its *signature* (for example the number of parameters and what they mean.) To find this out you can type ``help(turtle.color)`` into the Python shell. If there is a lot of text, Python will put the help text into a *pager*, which lets you page up and down. Press the :kbd:`q` key to exit the pager.
ro: Dacă vrei să fii creativ, poți modifica forma cu funcțiile ``turtle.width(...)`` și ``turtle.color(...)``. Cum utilizezi aceste funcții? Înainte de a utiliza o funcție trebuie să îi cunoști *semnătura* (de exemplu numărul de parametri și semnificația lor). Pentru a putea afla asta poți să scrii ``help(turtle.color)`` în consola interactivă Python. Dacă este prea mult text, Python o să pună documentația într-un *pager*, care îți permite să derulezi pagini sus si jos. Apasă tasta :kbd:`q` pentru a ieși din pager.

source: Are you seeing an error like this::
ko: 다음 같은 오류를 보고 있나요::
ro: Primești o eroare ca:

source: when trying to view help? In Python you have to import names before you can refer to them, so in a new Python interactive shell you'll need to ``import turtle`` before ``help(turtle.color)`` will work.
ro: atunci când vrei să vezi documentația? În Python trebuie să imporți numele înainte de a le utiliza, așa că într-o consolă interactivă nouă va trebui să dai comanda ``import turtle`` înainte ca ``help(turtle.color)`` să funcționeze.

source: Another way to find out about functions is to browse the `online documentation`_.
ro: O altă cale pentru a învăța despre funcții este consultarea `online documentation`_.

source: If you misdrew anything, you can tell turtle to erase its drawing board with the ``turtle.reset()`` directive or undo the most recent step with ``turtle.undo()``.
ro: Dacă ai desenat ceva greșit, poți să îi spui țestoasei să șteargă desenul cu directiva ``turtle.reset()`` sau să anulezi ultimul pas cu ``turtle.undo()``.

source: As you might have read in the help, you can modify the color with :samp:`turtle.color({colorstring})`. These include but are not limited to "red," "green," and "violet." See the `colours manual`_ for an extensive list.
ro: După cum e posibil să fi citit în documentație, poți modifica culoarea cu :samp:`turtle.color({colorstring})`. Valorile includ dar nu sunt limitate la "red" (roșu), "green"(verde), și "violet"(violet).

source: Drawing a rectangle
ko: 사각형을 그려보아요
ro: Desenarea unui dreptunghi

source: Can you draw a rectangle too?
ko: 사각형도 그릴 수 있어요 ???
ro: Poți să desenezi un dreptunghi?

source: How about a triangle? In an equilateral triangle (a triangle with all sides of equal length) each corner has an angle of 60 degrees.
ko: 삼각형은 어떤가요? 정삼각형(각 변의 길이가 같은 삼각형)의 세 귀퉁이는 60도 각을 가져요.
ro: Dar un triunghi? Într-un triunghi echilateral (un triunghi cu laturile egale) fiecare colț are un unghi de 60 de grade.

source: More squares
ko: 더 많은 사각형
ro: Mai multe pătrate

source: Now, draw a tilted square. And another one, and another one. You can experiment with the angles between the individual squares.
ko: 이제 바둑판처럼 배치한 사각현을 그려보기로 하겠어요. 그리고 다른거, 또 다른거. 각각의 사각형 사이에 각을 주는 경험도 할 수 있어요.
ro: Acum, desenează un pătrat înclinat. Și încă unul, și încă unul. Poți experimenta cu unghiurile între pătrate.

source: The picture shows three 20 degree turns. You could try 20, 30 and 40, for example.
ro: În imagine sunt trei întoarceri de 20 de grade. Poți încerca, de exemplu, 20, 30 și 40.
