Repository: OpenTechSchool/python-beginners
Catalog: source/locale/*/LC_MESSAGES/variables.po
Languages: es_cl, ro, ru

source: Variables
ro: Variabile
ru: Переменные

source: Introduction
es_cl: Introducción
ro: Introducere
ru: Введение

source: Whew. Experimenting with the angles requires you to change three different places in the code each time. Imagine you'd want to experiment with all of the square sizes, let alone with rectangles! We can do better than that.
es_cl: Uf! Experimentando con ángulos requiere que cambie tres partes distintas en el código cada vez. Imagine que quiera experimentar con todos los tamaños de cuadrados, ni hablar con rectángulos! Podemos hacer algo mejor que eso.
ro: Ptiu! Experimentarea cu aceste unghiuri îți cere să schimbi trei locuri diferite din cod de fiecare dată. Imaginează-ți că ai dori să expermentezi cu toate dimensiunile pătratelor, nu mai zic de dreptunghiuri! Asta se poate îmbunătăți.
ru: Хорошо. Экспериментируя в прошлом уроке, нам приходилось редактировать код в нескольких местах, чтобы изменить размеры наших геометрических фигур. Но представь, что будет, если мы захотим изменить размер квадрата не один раз, не говоря уже о прямоугольниках! Есть способ получше.

source: This is where **variables** come into play: You can tell Python that from now on, whenever you refer to a variable, you actually mean something else. That concept might be familiar from symbolic maths, where you would write: *Let x be 5.* Then *x \* 2* will obviously be *10*.
es_cl: Es aquí donde las **variables** entran en juego. Puede decirle a Python que, de ahora en adelante, cada vez que se refiera a una variable, usted se refiere en realidad a otra cosa. Este concepto puede ser familiar de matemáticas simbólicas, donde usted puede escribir: *Sea x igual a 5*. Entonces *x \* 2* será obviamente *10*.
ro: Și aici intră în scenă **variabilele**: poți să îi spui lui Python că din acest moment, de fiecare dată cănd faci referire la o variabilă, vrei de fapt să spui altceva. Conceptul acesta ar putea fi familiar de la simbolurile matematice, unde scrii *Fie x = 5*. Atunci *x \* 2* va fi evident *10*.
ru: Здесь **переменные** и вступают в игру. Можно сообщить Python'у, что отныне при обращении к переменной имеется в виду что-то другое. Ты наверняка узнал об этом из символической математики, где можно написать: *Пусть x равняется 5.* Тогда. очевидно, *x \* 2* будет равняться 10.

source: In Python syntax, that very statement translates to::
es_cl: En sintaxis de Python, esa misma sentencia se traduce como::
ro: În sintaxa Python, exact același lucru se scrie:
ru: С помощью Python'а сиё можно записать так::

source: After that statement, if you do ``print(x)``, it will actually output its value --- 5. Well, can use that for your turtle too::
es_cl: Despues de esa sentencia, si usted ejecuta ``print(x)``, realmente imprimirá su valor --- 5. Bien, puede usar eso para su tortuga también::
ro: După această declarație, dacă dai comanda ``print(x)``, va tipări de fapt valoarea --- 5. Ei bine, putem utiliza asta și pentru țestoasă:
ru: После этого, если ты выполнишь ``print(x)``, будет выведено значение переменной --- 5. Но, возможно, нашей черепашке настолько широкие возможности не нужны:

source: Variables can store all sorts of things, not just numbers. A typical other thing you want to have stored often is a **string** - a line of text. Strings are indicated with a starting and a leading ``"`` (double quote). You'll learn about this and other types, as those are called in Python, and what you can do with them later on.
es_cl: Variables pueden almacenar todo tipo de cosas, no sólo números. Otra cosa típica que a menudo es almacenada es un **string** - una línea de texto. Strings se indican con ``"``(comillas dobles) al inicio y al final. Aprenderá sobre este y otros tipos de variables, así como se declaran en Python y que puede hacer con ellas más adelante.
ro: Variabilele pot păstra tot felul de lucruri, nu numai numere. Un alt lucru pe care dorești de regulă să îl păstrezi sunt **șiruri de caractere** - o linie de text. Șirurile sunt indicate cu ``"`` (ghilimele) la început și la sfârșit. Vom învăța în continuare despre ele și despre alte tipuri, cum sunt ele denumite în Python, și ce poți face cu ele.
ru: Переменные могут быть чем угодно, не только числами. Типичной вещью, хранящейся в переменной, является **строка** - строка текста. Строки можно распознать по двойным кавычкам, с которых они начинаются и которыми они заканчиваются. Позже ты узнаешь больше об этом и других типах данных, их применении и о том, как они называются в Python.

source: You can even use a variable to give the turtle a name::
es_cl: Puede incluso usar una variable para darle un nombre a la tortuga::
ro: Poți utiliza o variabilă pentru a da un nume țestoasei:
ru: Ты можешь использовать переменную даже для того, чтобы дать черепашке имя::

source: Now every time you type ``timmy`` it knows you mean ``turtle``. You can still continue to use ``turtle`` as well::
es_cl: Ahora, cada vez que escriba ``timmy`` Python sabe que usted quiere decir ``turtle``. Usted puede seguir usando ``turtle`` si lo desea::
ro: Acum de fiecare dată când scrii ``timmy`` va ști că vorbești despre ``turtle``. Poți să folosești în continuare și ``turtle``:
ru: Теперь, когда ты вводишь ``timmy``, это будет означать ``turtle``. Но ты всё ещё можешь продолжать использовать и непосредственно ``turtle``::

source: A variable called angle
es_cl: Una variable llamada angle
ro: O variabilă numită angle (unghi)
ru: Переменная, зовущаяся углом

source: Exercise
es_cl: Ejercicio
ro: Exercițiu
ru: Упражнение

source: If we have a variable called ``angle``, how could we use that to experiment much faster with our tilted squares program?
es_cl: Si tenemos una variable llamada ``angle`` (ángulo en inglés), ¿cómo podemos usarla para experimentar más rápido con nuestro programa de cuadrados inclinados?
ro: Dacă avem o variabilă numită ``angle`` (unghi), cum o putem utiliza pentru a experimenta mai rapid cu programul nostru de pătrate înclinate?
ru: Как мы можем ускорить работу с нашей программой для рисования повёрнутых квадратов, имея переменную ``angle``?

source: Solution
es_cl: Solución
ro: Soluția
ru: Решение

source: ... and so on
es_cl: ... y así sucesivamente.
ro: ... și așa mai departe
ru: ... и так далее.

source: Bonus
ro: Supliment
ru: Дополнительно

source: Can you apply that principle to the size of the squares, too?
es_cl: ¿Puede aplicar este principio para el tamaño de los cuadrados también?
ro: Poți aplica acest principiu și la dimensiunea pătratelor?
ru: Можешь ли ты проделать то же самое с размером квадрата?

source: The house of santa claus
es_cl: La casa del viejito pascuero
ro: Casa lui Moș Crăciun
ru: Домик Деда Мороза

source: Draw a house.
es_cl: Dibuje una casa.
ro: Desenează o casă.
ru: Рисуем домик

source: You can calculate the length of the diagonal line with the Pythagorean theorem. That value is a good candidate to store in a variable. To calculate the square root of a number in Python, you'll need to import the *math* module and use the ``math.sqrt()`` function. The square of a number is calculated with the ``**`` operator::
es_cl: Puede calcular el largo de la diagonal con el teorema de Pitágoras. Ese valor es un buen candidato para ser guardado en una variable. Para calcular la raíz cuadrada de un número en Python, necesitará importar el módulo *math* y usar la función ``math.sqrt()``. El cuadrado de un número se calcula con el operador ``**``::
ro: Poți calcula lungimea diagonalei folosind teorema lui Pitagora. Această valoare este un bun candidat pentru a fi stocată într-o variabilă. Pentru a calcula rădăcina pătrată a unui număr în Python, va fi nevoie să imporți modulul *math* și să folosești funcția ``math.sqrt()``. Pătratul unui număr este calculat cu operatorul ``**``:
