Repository: OpenTechSchool/python-beginners
Catalog: source/locale/*/LC_MESSAGES/where_to_go.po
Languages: es_cl, ro, ru

source: Where to go from here
es_cl: Donde ir desde aqui
ro: Unde să mergi în continuare
ru: Что дальше?

source: Learning Python
es_cl: Aprendiendo Python
ro: Să învățăm Python
ru: Изучаем Python

source: Hopefully this tutorial has tought you just enough python to get you on your feet. However, there is much more that you can learn! Even professional programmers will always be trying to learn more about their language and how to code excellently with it.
es_cl: Esperamos que este tutorial le haya enseñado lo sufieciente de python para ponerlo en buen camino. Sin embargo, hay mucho más que puede aprender! Incluso programadores profesionales siempre estarán tratando de aprender más acerca del lenguaje y como escribir código de manera exelente.
ro: Sperăm că acest curs te-a învățat destul Python pentru a te descurca pe cont propriu. Exista însă mult mai multe lucruri pe care le poți învăța! Chiar și programatorii experimentați vor încerca întotdeauna să învețe mai multe despre limbajul lor și despre cum să scrie un cod bun.
ru: Мы надеемся, этой книги достаточно, чтобы вы могли себя достаточно уверенно чувствовать при работе с Python, но не стоит останавливаться на достигнутом, ведь даже профессиональные, опытные программисты постоянно стремятся получше изучить язык, на котором они пишут.

source: Books and Tutorials
es_cl: Libros y Tutoriales
ro: Cărți și Cursuri
ru: Книги и руководства

source: If you like learning from a book, there are heaps of good ones, and even many that can be read freely on the web!
es_cl: Si le gusta aprender desde un libro, hay muy buenos libros, incluso muchos de ellos se pueden leer gratis en la web!
ro: Dacă îți place să înveți din cărți, există o gramadă de cărți bune, și chiar multe care poti fi citite gratuit pe Internet!
ru: Если ты предпочитаешь обучаться с помощью книг, вот несколько из них, многие из которых ты можешь бесплатно прочитать в интернете:

source: `OTS Python Portal`_ - Check the rest of our tutorials, and look out for future workshops!
es_cl: `OTS Python Portal`_- Revise el resto de nuestros tutoriales, y espere por futuros talleres!
ro: `OTS Python Portal`_ - Verifică și restul cursurilor și viitoare ateliere!
ru: `OTS Python Portal` — остальные учебники от OpenTechSchool

source: `O'Reilly`_ publishes hundreds of books and ebooks, on python and many other technologies (check out Learning Python, 5th edition).
es_cl: `O'Reilly`_ Publica cientos de libro y ebooks, sobre python y muchas otras tecnologías (vea Learning Python, 5th edition).
ro: `O'Reilly`_ publică sute de cărți tipărite sau în format electronic, despre Python și multe alte tehnologii (verifică Learning Python, 5th edition).
ru: `O'Reilly` публикует немало печатных и бумажных книг, как по Python'у (Learning Python, например), так и по другим языкам/технологиям/

source: `Invent with Python`_ takes a practical approach, with three different ebooks that can be read online for free.
es_cl: `Invent with Python`_ toma un enfoque práctico, con tres libros diferentes que pueden leerse gratis en la web.
ro: `Invent with Python`_ are o abordare practică, cu trei cărți electronice diferite care pot fi citite gratuit.
ru: `Invent with Python`_ (разработка с Python) — направленная на практику серия из трёх различных книг.

source: `Learn Python the Hard Way`_ is a step by step full tutorial on the language, done in a unique style.
es_cl: `Learn Python the Hard Way`_ es un completo tutorial paso a paso sobre el lenguaje, escrito en un estilo único.
ro: `Learn Python the Hard Way`_ este un curs complet pas cu pas în limbaj, făcut într-un stil unic.
ru: `Learn Python the Hard Way`_ — уникальный пошаговый учебник по языку.

source: `Dive into Python 3`_ is another great book available online for free!
es_cl: `Dive into Python 3`_ es otro gran libro disponible gratis en línea!
ro: `Dive into Python 3`_ este o altă carte disponibilă gratuit!
ru: `Dive into Python 3`_ -- ещё одна неплохая книга, бесплатно доступная онлайн

source: Last but not least, python.org has `Its own tutorial!`_
es_cl: Por último, pero no menos importante, python.org tiene `su propio tutorial!`_
ro: Ultimul dar nu cel din urmă, python.org are `Its own tutorial!`_
ru: Последнее в списке (но не последнее по значимости) — `руководство <http://docs.python.org/3/tutorial/>`_ с сайта python.org

source: Online learning courses
es_cl: Cursos de aprendizaje en línea
ro: Cursuri online
ru: Обучающие онлайн-курсы

source: You wouldn't believe what you can do on the web these days. There are many courses on programming around!
es_cl: No creerá lo que puede hacer en las páginas web estos días. Hay muchos cursos de programación en toda la red!
ro: Este incredibil căt de multe poți face pe Internet în zilele noastre. Există multe cursuri de programare pe aici!
ru: Многого можно сделать в интернете в наши дни, например, пройти курсы по программированию.

source: `Edx`_ - with top universities like Stanford, MIT, Harvard and Berkley giving out interactive courses for free, it's hard to turn this down. You'll have to look for ones coming up soon!
es_cl: `Edx`_- con las mejores universidades como Stanford, MIT, Harvard y Berkley dando cursos interactivos gratis, es difícil no tentarse con uno de ellos. Debe buscar los que empezarán pronto!
ro: `Edx`_ - cu universități de top ca Stanford, MIT, Harvard și Berkley care pun la dispoziție gratuit cursuri, este greu să refuzi. Trebuie să vezi ce va mai apărea!

source: `Coursera`_ is very similar to Edx, with even more courses, and some that can be taken at any time.
es_cl: `Coursera`_ es muy parecido a Edx, con incluso más cursos, y algunos de ellos se pueden tomar en cualquier fecha.
ro: `Coursera`_ este asemănător cu Edx, cu și mai multe cursuri, și o pate din ele pot fi urmărite oricând.
ru: `Coursera`_. Похоже на Edx, но курсов (которые можно пройти в любое время) больше.

source: `CodeAcademy`_ - luckily this one has a python-specific course that can be taken at any time, and many other practical language courses.
es_cl: `CodeAcademy`_-afortunadamente este sitio tiene un curso específico sobre Python que puede ser tomado cuando quiera, y muchos otros cursos prácticos de otros lenguajes.
ro: `CodeAcademy`_ - din fericire acesta are un curs specific Python care poate fi urmat oricând, și multe cursuri practice pentru alte limbaje.
ru: `CodeAcademy`_ — имеет один python-курс (и несколько курсов по другим языкам программирования), который может быть который может быть пройден в любое время

source: What to do with Python
es_cl: Que hacer con Python
ro: Ce poți face cu Python
ru: Что можно написать на Python

source: Well, that's a tough one! See, practically anything you can think of involving some electronics - from your TV remote, to a smartphone, to the backend of a popular web service, to the scheduling of airport landings, to the software you use everyday - it all involves some programming somewhere!
es_cl: Bueno, es una difícil pregunta! Practicamente cualquier cosa que involucre algo de electrónica- desde el control remoto de la tv, a un smartphone, al soporte de un popular servicio web, calendarización de aterrizajes de aviones en aeropuertos, o el software que utilice día a día - todo involucra algo de programación en alguna parte!
ro: Asta chiar e o întrebare dificilă! Vezi tu, practic orice îți vine în minte care implică ceva electronic - de la telecomanda ta pentru televizor, până la un telefon inteligent, până la ce este in spatele unui serviciu web, până la programarea aterizărilor pe un aeroport, până la programele pe care le vezi în fiecare zi - toate acestea implică programare pe undeva!

source: And not only is it a big field practically, but also technically and academically. As soon as you have a basic understanding of a general language like python, you can start working on all manner of subjects: web frontends, web backend services, data analysis and statistics, Artificial Intelligence, GUI design, robotics, software development of all kinds, online transactions, automation of everything, and many more.
es_cl: Y no es solamente un gran campo en la práctica, sino también técnica y académicamente. Tan pronto como tenga una comprensión básica de un lenguaje general como python, puede empezar a trabajar en todo tipo de ámbitos: portales web, soporte bajo un servicio web, análisis de datos y estadísticas, inteligencia artificial, diseño de GUI, robótica, desarrollo de software de todo tipo, traductores en línea, automatización de todo y mucho más.
ro: Și nu se limitează doar la latura practică, dar și la cea tehnică și academică. Imediat ce ai înțeles bazele unui limbaj de uz general ca Python poți începe să lucrezi la diverse lucruri: interfețe web, servicii de backend web, analiză de date și statistică, Inteligență Artificială, design GUI (Graphical User Interface - Interfață Grafică Utilizator), robotică, dezvoltare software de toate felurile, tranzacții online, automatizări și multe altele.

source: We wouldn't blame if that all sounds daunting, so here's some practical advice, that takes advantage of how wide a field "programming" is:
es_cl: No le culpamos si todo esto suena un poco desalentador, pero le daremos un consejo práctico, que toma en cuenta la ventaja de lo aplio que es el campo de la "programación":
ro: Nu ți-o luăm în nume de rău dacă îți sună descurajator, așa că iată niște sfaturi practice pentru a înțelege cât de larg este domeniul "programare":

source: **Apply your new skills to whatever you're passionate about.**
es_cl: **Aplique sus nuevas habilidades a todo lo que le apasione.**
ro: **Aplică noile tale competențe pentru orice te pasionează.**
ru: **Примени свои новые знания в том, чем ты увлекаешься.**

source: Whether that's starting a new business, helping you do some task involving data faster, putting up an online site, calculating advantages in a game you play, creating art and music, or anything else, finding out how to use programming to help with whatever floats your boat will make learning much more exciting and relevant. Feel free to ask someone more experienced if you have no idea where to start, but always mention what makes you tick!
es_cl: Ya sea que va a iniciar un nuevo negocio, ayude a realizar tareas que involucren analizar datos más rapido, ponga en línea un sitio web, calcule las ventajas en un juego que este jugando, cree arte o música, o cualquier cosa; averiguar cómo usar la programación para ayudar con cualquier cosa que haga flotar su bote hará el aprendizaje mucho más interesante y relevante. Siéntase libre de consultar con alguien que tenga más experiencia si no sabe por donde empezar, pero siempre mencione que es lo que le emociona!
ro: Fie că este vorba de a începe o afacere, ajutându-te să execuți niște prelucrări de date mai rapid, să pui un site web online, să calculezi șansele într-un joc pe care îl joci, să creezi artă și muzică, sau orice altceva, să descoperi cum poți folosi programarea pentru a te ajuta la ce ai tu nevoie o să transforme învățarea în ceva mult mai atractiv și relevant. Nu ezita să întrebi pe altcineva cu mai multă experiență dacă nu știi cum să începi, dar întotdeauna gândește-te la ce vrei tu să obții!
